{
    "snapshot": {
        "element": [
            {
                "path": "NamingSystem",
                "max": "*",
                "definition": "A curated namespace that issues unique symbols within that namespace for the identification of concepts, people, devices, etc.  Represents a \"System\" used within the Identifier and Coding data types.",
                "min": 0,
                "type": [
                    {
                        "code": "DomainResource"
                    }
                ],
                "constraint": [
                    {
                        "key": "nsd-2",
                        "severity": "error",
                        "xpath": "not(exists(for $type in distinct-values(f:uniqueId/f:type/@value) return if (count(f:uniqueId[f:type/@value=$type and f:preferred/@value=true()])>1) then $type else ()))",
                        "human": "Can't have more than one preferred identifier for a type"
                    },
                    {
                        "key": "nsd-3",
                        "severity": "error",
                        "xpath": "not(f:replacedBy) or f:status/@value='retired'",
                        "human": "Can only have replacedBy if naming system is retired"
                    },
                    {
                        "key": "nsd-1",
                        "severity": "error",
                        "xpath": "not(f:kind/@value='root' and f:uniqueId/f:type/@value=('uuid', 'ruid'))",
                        "human": "Root systems cannot have uuid or sid identifiers"
                    }
                ],
                "short": "System of unique identification",
                "mapping": [
                    {
                        "identity": "v2",
                        "map": "N/A"
                    },
                    {
                        "identity": "rim",
                        "map": "N/A"
                    },
                    {
                        "identity": "w5",
                        "map": "conformance.terminology"
                    }
                ]
            },
            {
                "path": "NamingSystem.id",
                "max": "1",
                "definition": "The logical id of the resource, as used in the URL for the resource. Once assigned, this value never changes.",
                "min": 0,
                "comments": "The only time that a resource does not have an id is when it is being submitted to the server using a create operation. Bundles always have an id, though it is usually a generated UUID.",
                "short": "Logical id of this artifact",
                "type": [
                    {
                        "code": "id"
                    }
                ],
                "isSummary": true
            },
            {
                "path": "NamingSystem.meta",
                "max": "1",
                "definition": "The metadata about the resource. This is content that is maintained by the infrastructure. Changes to the content may not always be associated with version changes to the resource.",
                "min": 0,
                "type": [
                    {
                        "code": "Meta"
                    }
                ],
                "short": "Metadata about the resource",
                "isSummary": true
            },
            {
                "path": "NamingSystem.implicitRules",
                "max": "1",
                "definition": "A reference to a set of rules that were followed when the resource was constructed, and which must be understood when processing the content.",
                "min": 0,
                "comments": "Asserting this rule set restricts the content to be only understood by a limited set of trading partners. This inherently limits the usefulness of the data in the long term. However, the existing health eco-system is highly fractured, and not yet ready to define, collect, and exchange data in a generally computable sense. Wherever possible, implementers and/or specification writers should avoid using this element as much as possible.",
                "short": "A set of rules under which this content was created",
                "type": [
                    {
                        "code": "uri"
                    }
                ],
                "isSummary": true,
                "isModifier": true
            },
            {
                "path": "NamingSystem.language",
                "max": "1",
                "definition": "The base language in which the resource is written.",
                "min": 0,
                "comments": "Language is provided to support indexing and accessibility (typically, services such as text to speech use the language tag). The html language tag in the narrative applies  to the narrative. The language tag on the resource may be used to specify the language of other presentations generated from the data in the resource  Not all the content has to be in the base language. The Resource.language should not be assumed to apply to the narrative automatically. If a language is specified, it should it also be specified on the div element in the html (see rules in HTML5 for information about the relationship between xml:lang and the html lang attribute).",
                "short": "Language of the resource content",
                "type": [
                    {
                        "code": "code"
                    }
                ],
                "binding": {
                    "strength": "required",
                    "valueSetUri": "http://tools.ietf.org/html/bcp47",
                    "description": "A human language."
                }
            },
            {
                "path": "NamingSystem.text",
                "max": "1",
                "definition": "A human-readable narrative that contains a summary of the resource, and may be used to represent the content of the resource to a human. The narrative need not encode all the structured data, but is required to contain sufficient detail to make it \"clinically safe\" for a human to just read the narrative. Resource definitions may define what content should be represented in the narrative to ensure clinical safety.",
                "min": 0,
                "condition": [
                    "dom-1"
                ],
                "comments": "Contained resources do not have narrative. Resources that are not contained SHOULD have a narrative.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "Act.text?"
                    }
                ],
                "short": "Text summary of the resource, for human interpretation",
                "type": [
                    {
                        "code": "Narrative"
                    }
                ],
                "alias": [
                    "narrative",
                    "html",
                    "xhtml",
                    "display"
                ]
            },
            {
                "path": "NamingSystem.contained",
                "max": "*",
                "definition": "These resources do not have an independent existence apart from the resource that contains them - they cannot be identified independently, and nor can they have their own independent transaction scope.",
                "min": 0,
                "comments": "This should never be done when the content can be identified properly, as once identification is lost, it is extremely difficult (and context dependent) to restore it again.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "N/A"
                    }
                ],
                "short": "Contained, inline Resources",
                "type": [
                    {
                        "code": "Resource"
                    }
                ],
                "alias": [
                    "inline resources",
                    "anonymous resources",
                    "contained resources"
                ]
            },
            {
                "path": "NamingSystem.extension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the resource. In order to make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.",
                "min": 0,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "N/A"
                    }
                ],
                "short": "Additional Content defined by implementations",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content"
                ]
            },
            {
                "path": "NamingSystem.modifierExtension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the resource, and that modifies the understanding of the element that contains it. Usually modifier elements provide negation or qualification. In order to make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.",
                "min": 0,
                "isModifier": true,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "N/A"
                    }
                ],
                "short": "Extensions that cannot be ignored",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content"
                ]
            },
            {
                "path": "NamingSystem.name",
                "max": "1",
                "definition": "The descriptive name of this particular identifier type or code system.",
                "min": 1,
                "comments": "The\"symbolic name\" for an OID would be captured as an extension.",
                "short": "Human-readable label",
                "type": [
                    {
                        "code": "string"
                    }
                ]
            },
            {
                "path": "NamingSystem.status",
                "max": "1",
                "definition": "Indicates whether the naming system is \"ready for use\" or not.",
                "min": 1,
                "type": [
                    {
                        "code": "code"
                    }
                ],
                "mapping": [
                    {
                        "identity": "w5",
                        "map": "status"
                    }
                ],
                "short": "draft | active | retired",
                "binding": {
                    "strength": "required",
                    "description": "The lifecycle status of a Value Set or Concept Map.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/conformance-resource-status"
                    }
                },
                "isModifier": true
            },
            {
                "path": "NamingSystem.kind",
                "max": "1",
                "definition": "Indicates the purpose for the naming system - what kinds of things does it make unique?",
                "min": 1,
                "type": [
                    {
                        "code": "code"
                    }
                ],
                "mapping": [
                    {
                        "identity": "w5",
                        "map": "class"
                    }
                ],
                "short": "codesystem | identifier | root",
                "binding": {
                    "strength": "required",
                    "description": "Identifies the purpose of the naming system.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/namingsystem-type"
                    }
                }
            },
            {
                "path": "NamingSystem.publisher",
                "max": "1",
                "definition": "The name of the individual or organization that published the naming system.",
                "min": 0,
                "requirements": "Helps establish the \"authority/credibility\" of the naming system.  May also allow for contact.",
                "mapping": [
                    {
                        "identity": "w5",
                        "map": "who.witness"
                    }
                ],
                "short": "Name of the publisher (Organization or individual)",
                "comments": "Usually an organization, but may be an individual. This item SHOULD be populated unless the information is available from context.",
                "isSummary": true,
                "type": [
                    {
                        "code": "string"
                    }
                ]
            },
            {
                "path": "NamingSystem.contact",
                "max": "*",
                "definition": "Contacts to assist a user in finding and communicating with the publisher.",
                "min": 0,
                "comments": "May be a web site, an email address, a telephone number (tel:), etc.",
                "short": "Contact details of the publisher",
                "type": [
                    {
                        "code": "BackboneElement"
                    }
                ],
                "isSummary": true
            },
            {
                "path": "NamingSystem.contact.id",
                "max": "1",
                "representation": [
                    "xmlAttr"
                ],
                "definition": "unique id for the element within a resource (for internal references).",
                "min": 0,
                "type": [
                    {
                        "code": "id"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "n/a"
                    }
                ],
                "short": "xml:id (or equivalent in JSON)"
            },
            {
                "path": "NamingSystem.contact.extension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the element. In order to make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.",
                "min": 0,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "n/a"
                    }
                ],
                "short": "Additional Content defined by implementations",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content"
                ]
            },
            {
                "path": "NamingSystem.contact.modifierExtension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the element, and that modifies the understanding of the element that contains it. Usually modifier elements provide negation or qualification. In order to make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.",
                "min": 0,
                "isModifier": true,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "N/A"
                    }
                ],
                "short": "Extensions that cannot be ignored",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content",
                    "modifiers"
                ]
            },
            {
                "path": "NamingSystem.contact.name",
                "max": "1",
                "definition": "The name of an individual to contact regarding the naming system.",
                "min": 0,
                "comments": "If there is no named individual, the telecom is for the organization as a whole.",
                "short": "Name of a individual to contact",
                "type": [
                    {
                        "code": "string"
                    }
                ],
                "isSummary": true
            },
            {
                "path": "NamingSystem.contact.telecom",
                "max": "*",
                "definition": "Contact details for individual (if a name was provided) or the publisher.",
                "min": 0,
                "type": [
                    {
                        "code": "ContactPoint"
                    }
                ],
                "short": "Contact details for individual or publisher",
                "isSummary": true
            },
            {
                "path": "NamingSystem.responsible",
                "max": "1",
                "definition": "The name of the organization that is responsible for issuing identifiers or codes for this namespace and ensuring their non-collision.",
                "min": 0,
                "comments": "This is the primary organization.  Responsibility for some aspects of a namespace may be delegated.",
                "mapping": [
                    {
                        "identity": "w5",
                        "map": "who.witness"
                    }
                ],
                "short": "Who maintains system namespace?",
                "type": [
                    {
                        "code": "string"
                    }
                ]
            },
            {
                "path": "NamingSystem.date",
                "max": "1",
                "definition": "The date  (and optionally time) when the system was registered or published. The date must change when the business version changes, if it does, and it must change if the status code changes. In addition, it should change when the substantive content of the registration changes.",
                "min": 1,
                "comments": "Additional specific dates may be added as extensions.",
                "mapping": [
                    {
                        "identity": "w5",
                        "map": "when.recorded"
                    }
                ],
                "short": "Publication Date(/time)",
                "type": [
                    {
                        "code": "dateTime"
                    }
                ],
                "isSummary": true
            },
            {
                "path": "NamingSystem.type",
                "max": "1",
                "definition": "Categorizes a naming system for easier search by grouping related naming systems.",
                "min": 0,
                "comments": "This will most commonly be used for identifier namespaces, but categories could potentially be useful for code systems and authorities as well.",
                "short": "e.g. driver,  provider,  patient, bank etc.",
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "binding": {
                    "strength": "extensible",
                    "description": "A coded type for an identifier that can be used to determine which identifier to use for a specific purpose.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/identifier-type"
                    }
                }
            },
            {
                "path": "NamingSystem.description",
                "max": "1",
                "definition": "Details about what the namespace identifies including scope, granularity, version labeling, etc.",
                "min": 0,
                "type": [
                    {
                        "code": "string"
                    }
                ],
                "short": "What does naming system identify?"
            },
            {
                "path": "NamingSystem.useContext",
                "max": "*",
                "definition": "The content was developed with a focus and intent of supporting the contexts that are listed. These terms may be used to assist with indexing and searching of naming systems.",
                "min": 0,
                "requirements": "Assist in searching for appropriate content.",
                "short": "Content intends to support these contexts",
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "isSummary": true,
                "binding": {
                    "strength": "extensible",
                    "description": "Indicates the countries, regions, disciplines and other aspects of use within which this artifact is targeted for use.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/use-context"
                    }
                }
            },
            {
                "path": "NamingSystem.usage",
                "max": "1",
                "definition": "Provides guidance on the use of the namespace, including the handling of formatting characters, use of upper vs. lower case, etc.",
                "min": 0,
                "type": [
                    {
                        "code": "string"
                    }
                ],
                "short": "How/where is it used"
            },
            {
                "path": "NamingSystem.uniqueId",
                "max": "*",
                "definition": "Indicates how the system may be identified when referenced in electronic exchange.",
                "min": 1,
                "comments": "Multiple identifiers may exist, either due to duplicate registration, regional rules, needs of different communication technologies, etc.",
                "short": "Unique identifiers used for system",
                "type": [
                    {
                        "code": "BackboneElement"
                    }
                ]
            },
            {
                "path": "NamingSystem.uniqueId.id",
                "max": "1",
                "representation": [
                    "xmlAttr"
                ],
                "definition": "unique id for the element within a resource (for internal references).",
                "min": 0,
                "type": [
                    {
                        "code": "id"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "n/a"
                    }
                ],
                "short": "xml:id (or equivalent in JSON)"
            },
            {
                "path": "NamingSystem.uniqueId.extension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the element. In order to make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.",
                "min": 0,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "n/a"
                    }
                ],
                "short": "Additional Content defined by implementations",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content"
                ]
            },
            {
                "path": "NamingSystem.uniqueId.modifierExtension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the element, and that modifies the understanding of the element that contains it. Usually modifier elements provide negation or qualification. In order to make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.",
                "min": 0,
                "isModifier": true,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "N/A"
                    }
                ],
                "short": "Extensions that cannot be ignored",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content",
                    "modifiers"
                ]
            },
            {
                "path": "NamingSystem.uniqueId.type",
                "max": "1",
                "definition": "Identifies the unique identifier scheme used for this particular identifier.",
                "min": 1,
                "comments": "Different identifier types may be used in different types of communications (OIDs for v3, URIs for FHIR, etc.).  Other includes RUIDs from v3, standard v2 code name strings, etc.",
                "short": "oid | uuid | uri | other",
                "type": [
                    {
                        "code": "code"
                    }
                ],
                "binding": {
                    "strength": "required",
                    "description": "Identifies the style of unique identifier used to identify a namespace.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/namingsystem-identifier-type"
                    }
                }
            },
            {
                "path": "NamingSystem.uniqueId.value",
                "max": "1",
                "definition": "The string that should be sent over the wire to identify the code system or identifier system.",
                "min": 1,
                "comments": "If the value is a URI intended for use as FHIR system identifier, the URI should not contain \"\\\" or \"?\" or \",\" since this makes escaping very difficult.",
                "mapping": [
                    {
                        "identity": "w5",
                        "map": "id"
                    }
                ],
                "short": "The unique identifier",
                "type": [
                    {
                        "code": "string"
                    }
                ]
            },
            {
                "path": "NamingSystem.uniqueId.preferred",
                "max": "1",
                "definition": "Indicates whether this identifier is the \"preferred\" identifier of this type.",
                "min": 0,
                "meaningWhenMissing": "If there are multiple ids, and one is labelled \"preferred\", then the assumption is that the others are not preferred. In the absence of any id marked as preferred, no inference can be drawn",
                "type": [
                    {
                        "code": "boolean"
                    }
                ],
                "short": "Is this the id that should be used for this type"
            },
            {
                "path": "NamingSystem.uniqueId.period",
                "max": "1",
                "definition": "Identifies the period of time over which this identifier is considered appropriate to refer to the naming system.  Outside of this window, the identifier might be non-deterministic.",
                "min": 0,
                "comments": "Within a registry, a given identifier should only be \"active\" for a single namespace at a time.  (Ideally, an identifier should only ever be associated with a single namespace across all time).",
                "short": "When is identifier valid?",
                "type": [
                    {
                        "code": "Period"
                    }
                ]
            },
            {
                "path": "NamingSystem.replacedBy",
                "max": "1",
                "definition": "For naming systems that are retired, indicates the naming system that should be used in their place (if any).",
                "min": 0,
                "condition": [
                    "nsd-3"
                ],
                "type": [
                    {
                        "code": "Reference",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/NamingSystem"
                        ]
                    }
                ],
                "short": "Use this instead"
            }
        ]
    },
    "publisher": "Health Level Seven International (FHIR Infrastructure)",
    "abstract": false,
    "extension": [
        {
            "valueInteger": 1,
            "url": "http://hl7.org/fhir/StructureDefinition/structuredefinition-fmm"
        }
    ],
    "differential": {
        "element": [
            {
                "path": "NamingSystem",
                "max": "*",
                "definition": "A curated namespace that issues unique symbols within that namespace for the identification of concepts, people, devices, etc.  Represents a \"System\" used within the Identifier and Coding data types.",
                "min": 0,
                "type": [
                    {
                        "code": "DomainResource"
                    }
                ],
                "constraint": [
                    {
                        "key": "nsd-2",
                        "severity": "error",
                        "xpath": "not(exists(for $type in distinct-values(f:uniqueId/f:type/@value) return if (count(f:uniqueId[f:type/@value=$type and f:preferred/@value=true()])>1) then $type else ()))",
                        "human": "Can't have more than one preferred identifier for a type"
                    },
                    {
                        "key": "nsd-3",
                        "severity": "error",
                        "xpath": "not(f:replacedBy) or f:status/@value='retired'",
                        "human": "Can only have replacedBy if naming system is retired"
                    },
                    {
                        "key": "nsd-1",
                        "severity": "error",
                        "xpath": "not(f:kind/@value='root' and f:uniqueId/f:type/@value=('uuid', 'ruid'))",
                        "human": "Root systems cannot have uuid or sid identifiers"
                    }
                ],
                "short": "System of unique identification",
                "mapping": [
                    {
                        "identity": "v2",
                        "map": "N/A"
                    },
                    {
                        "identity": "rim",
                        "map": "N/A"
                    },
                    {
                        "identity": "w5",
                        "map": "conformance.terminology"
                    }
                ]
            },
            {
                "path": "NamingSystem.name",
                "max": "1",
                "definition": "The descriptive name of this particular identifier type or code system.",
                "min": 1,
                "comments": "The\"symbolic name\" for an OID would be captured as an extension.",
                "short": "Human-readable label",
                "type": [
                    {
                        "code": "string"
                    }
                ]
            },
            {
                "path": "NamingSystem.status",
                "max": "1",
                "definition": "Indicates whether the naming system is \"ready for use\" or not.",
                "min": 1,
                "type": [
                    {
                        "code": "code"
                    }
                ],
                "mapping": [
                    {
                        "identity": "w5",
                        "map": "status"
                    }
                ],
                "short": "draft | active | retired",
                "binding": {
                    "strength": "required",
                    "description": "The lifecycle status of a Value Set or Concept Map.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/conformance-resource-status"
                    }
                },
                "isModifier": true
            },
            {
                "path": "NamingSystem.kind",
                "max": "1",
                "definition": "Indicates the purpose for the naming system - what kinds of things does it make unique?",
                "min": 1,
                "type": [
                    {
                        "code": "code"
                    }
                ],
                "mapping": [
                    {
                        "identity": "w5",
                        "map": "class"
                    }
                ],
                "short": "codesystem | identifier | root",
                "binding": {
                    "strength": "required",
                    "description": "Identifies the purpose of the naming system.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/namingsystem-type"
                    }
                }
            },
            {
                "path": "NamingSystem.publisher",
                "max": "1",
                "definition": "The name of the individual or organization that published the naming system.",
                "min": 0,
                "requirements": "Helps establish the \"authority/credibility\" of the naming system.  May also allow for contact.",
                "mapping": [
                    {
                        "identity": "w5",
                        "map": "who.witness"
                    }
                ],
                "short": "Name of the publisher (Organization or individual)",
                "comments": "Usually an organization, but may be an individual. This item SHOULD be populated unless the information is available from context.",
                "isSummary": true,
                "type": [
                    {
                        "code": "string"
                    }
                ]
            },
            {
                "path": "NamingSystem.contact",
                "max": "*",
                "definition": "Contacts to assist a user in finding and communicating with the publisher.",
                "min": 0,
                "comments": "May be a web site, an email address, a telephone number (tel:), etc.",
                "short": "Contact details of the publisher",
                "type": [
                    {
                        "code": "BackboneElement"
                    }
                ],
                "isSummary": true
            },
            {
                "path": "NamingSystem.contact.name",
                "max": "1",
                "definition": "The name of an individual to contact regarding the naming system.",
                "min": 0,
                "comments": "If there is no named individual, the telecom is for the organization as a whole.",
                "short": "Name of a individual to contact",
                "type": [
                    {
                        "code": "string"
                    }
                ],
                "isSummary": true
            },
            {
                "path": "NamingSystem.contact.telecom",
                "max": "*",
                "definition": "Contact details for individual (if a name was provided) or the publisher.",
                "min": 0,
                "type": [
                    {
                        "code": "ContactPoint"
                    }
                ],
                "short": "Contact details for individual or publisher",
                "isSummary": true
            },
            {
                "path": "NamingSystem.responsible",
                "max": "1",
                "definition": "The name of the organization that is responsible for issuing identifiers or codes for this namespace and ensuring their non-collision.",
                "min": 0,
                "comments": "This is the primary organization.  Responsibility for some aspects of a namespace may be delegated.",
                "mapping": [
                    {
                        "identity": "w5",
                        "map": "who.witness"
                    }
                ],
                "short": "Who maintains system namespace?",
                "type": [
                    {
                        "code": "string"
                    }
                ]
            },
            {
                "path": "NamingSystem.date",
                "max": "1",
                "definition": "The date  (and optionally time) when the system was registered or published. The date must change when the business version changes, if it does, and it must change if the status code changes. In addition, it should change when the substantive content of the registration changes.",
                "min": 1,
                "comments": "Additional specific dates may be added as extensions.",
                "mapping": [
                    {
                        "identity": "w5",
                        "map": "when.recorded"
                    }
                ],
                "short": "Publication Date(/time)",
                "type": [
                    {
                        "code": "dateTime"
                    }
                ],
                "isSummary": true
            },
            {
                "path": "NamingSystem.type",
                "max": "1",
                "definition": "Categorizes a naming system for easier search by grouping related naming systems.",
                "min": 0,
                "comments": "This will most commonly be used for identifier namespaces, but categories could potentially be useful for code systems and authorities as well.",
                "short": "e.g. driver,  provider,  patient, bank etc.",
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "binding": {
                    "strength": "extensible",
                    "description": "A coded type for an identifier that can be used to determine which identifier to use for a specific purpose.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/identifier-type"
                    }
                }
            },
            {
                "path": "NamingSystem.description",
                "max": "1",
                "definition": "Details about what the namespace identifies including scope, granularity, version labeling, etc.",
                "min": 0,
                "type": [
                    {
                        "code": "string"
                    }
                ],
                "short": "What does naming system identify?"
            },
            {
                "path": "NamingSystem.useContext",
                "max": "*",
                "definition": "The content was developed with a focus and intent of supporting the contexts that are listed. These terms may be used to assist with indexing and searching of naming systems.",
                "min": 0,
                "requirements": "Assist in searching for appropriate content.",
                "short": "Content intends to support these contexts",
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "isSummary": true,
                "binding": {
                    "strength": "extensible",
                    "description": "Indicates the countries, regions, disciplines and other aspects of use within which this artifact is targeted for use.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/use-context"
                    }
                }
            },
            {
                "path": "NamingSystem.usage",
                "max": "1",
                "definition": "Provides guidance on the use of the namespace, including the handling of formatting characters, use of upper vs. lower case, etc.",
                "min": 0,
                "type": [
                    {
                        "code": "string"
                    }
                ],
                "short": "How/where is it used"
            },
            {
                "path": "NamingSystem.uniqueId",
                "max": "*",
                "definition": "Indicates how the system may be identified when referenced in electronic exchange.",
                "min": 1,
                "comments": "Multiple identifiers may exist, either due to duplicate registration, regional rules, needs of different communication technologies, etc.",
                "short": "Unique identifiers used for system",
                "type": [
                    {
                        "code": "BackboneElement"
                    }
                ]
            },
            {
                "path": "NamingSystem.uniqueId.type",
                "max": "1",
                "definition": "Identifies the unique identifier scheme used for this particular identifier.",
                "min": 1,
                "comments": "Different identifier types may be used in different types of communications (OIDs for v3, URIs for FHIR, etc.).  Other includes RUIDs from v3, standard v2 code name strings, etc.",
                "short": "oid | uuid | uri | other",
                "type": [
                    {
                        "code": "code"
                    }
                ],
                "binding": {
                    "strength": "required",
                    "description": "Identifies the style of unique identifier used to identify a namespace.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/namingsystem-identifier-type"
                    }
                }
            },
            {
                "path": "NamingSystem.uniqueId.value",
                "max": "1",
                "definition": "The string that should be sent over the wire to identify the code system or identifier system.",
                "min": 1,
                "comments": "If the value is a URI intended for use as FHIR system identifier, the URI should not contain \"\\\" or \"?\" or \",\" since this makes escaping very difficult.",
                "mapping": [
                    {
                        "identity": "w5",
                        "map": "id"
                    }
                ],
                "short": "The unique identifier",
                "type": [
                    {
                        "code": "string"
                    }
                ]
            },
            {
                "path": "NamingSystem.uniqueId.preferred",
                "max": "1",
                "definition": "Indicates whether this identifier is the \"preferred\" identifier of this type.",
                "min": 0,
                "meaningWhenMissing": "If there are multiple ids, and one is labelled \"preferred\", then the assumption is that the others are not preferred. In the absence of any id marked as preferred, no inference can be drawn",
                "type": [
                    {
                        "code": "boolean"
                    }
                ],
                "short": "Is this the id that should be used for this type"
            },
            {
                "path": "NamingSystem.uniqueId.period",
                "max": "1",
                "definition": "Identifies the period of time over which this identifier is considered appropriate to refer to the naming system.  Outside of this window, the identifier might be non-deterministic.",
                "min": 0,
                "comments": "Within a registry, a given identifier should only be \"active\" for a single namespace at a time.  (Ideally, an identifier should only ever be associated with a single namespace across all time).",
                "short": "When is identifier valid?",
                "type": [
                    {
                        "code": "Period"
                    }
                ]
            },
            {
                "path": "NamingSystem.replacedBy",
                "max": "1",
                "definition": "For naming systems that are retired, indicates the naming system that should be used in their place (if any).",
                "min": 0,
                "condition": [
                    "nsd-3"
                ],
                "type": [
                    {
                        "code": "Reference",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/NamingSystem"
                        ]
                    }
                ],
                "short": "Use this instead"
            }
        ]
    },
    "resourceType": "StructureDefinition",
    "description": "Base StructureDefinition for NamingSystem Resource",
    "url": "http://hl7.org/fhir/StructureDefinition/NamingSystem",
    "kind": "resource",
    "contact": [
        {
            "telecom": [
                {
                    "system": "other",
                    "value": "http://hl7.org/fhir"
                }
            ]
        },
        {
            "telecom": [
                {
                    "system": "other",
                    "value": "http://www.hl7.org/Special/committees/fiwg/index.cfm"
                }
            ]
        }
    ],
    "mapping": [
        {
            "identity": "v2",
            "name": "HL7 v2",
            "uri": "http://hl7.org/v2"
        },
        {
            "identity": "rim",
            "name": "RIM",
            "uri": "http://hl7.org/v3"
        },
        {
            "identity": "w5",
            "name": "W5 Mapping",
            "uri": "http://hl7.org/fhir/w5"
        }
    ],
    "status": "draft",
    "base": "http://hl7.org/fhir/StructureDefinition/DomainResource",
    "name": "NamingSystem",
    "id": "NamingSystem",
    "meta": {
        "lastUpdated": "2015-10-24T07:41:03.495+11:00"
    },
    "fhirVersion": "1.0.2",
    "date": "2015-10-24T07:41:03+11:00"
}