{
    "snapshot": {
        "element": [
            {
                "path": "NutritionOrder",
                "max": "*",
                "definition": "A request to supply a diet, formula feeding (enteral) or oral nutritional supplement to a patient/resident.",
                "min": 0,
                "comments": "Referenced by an Order Request (workflow).",
                "constraint": [
                    {
                        "key": "nor-1",
                        "severity": "warning",
                        "xpath": "exists(f:oralDiet) or exists(f:supplement) or exists(f:enteralFormula)",
                        "human": "Nutrition Order SHALL contain either Oral Diet , Supplement, or Enteral Formula class"
                    }
                ],
                "short": "A request for a diet, formula or nutritional supplement",
                "type": [
                    {
                        "code": "DomainResource"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "SupplyRequest"
                    },
                    {
                        "identity": "w5",
                        "map": "clinical.careprovision"
                    }
                ],
                "alias": [
                    "Diet Order",
                    "Diet",
                    "Nutritional Supplement",
                    "Enteral Nutrition"
                ]
            },
            {
                "path": "NutritionOrder.id",
                "max": "1",
                "definition": "The logical id of the resource, as used in the URL for the resource. Once assigned, this value never changes.",
                "min": 0,
                "comments": "The only time that a resource does not have an id is when it is being submitted to the server using a create operation. Bundles always have an id, though it is usually a generated UUID.",
                "short": "Logical id of this artifact",
                "type": [
                    {
                        "code": "id"
                    }
                ],
                "isSummary": true
            },
            {
                "path": "NutritionOrder.meta",
                "max": "1",
                "definition": "The metadata about the resource. This is content that is maintained by the infrastructure. Changes to the content may not always be associated with version changes to the resource.",
                "min": 0,
                "type": [
                    {
                        "code": "Meta"
                    }
                ],
                "short": "Metadata about the resource",
                "isSummary": true
            },
            {
                "path": "NutritionOrder.implicitRules",
                "max": "1",
                "definition": "A reference to a set of rules that were followed when the resource was constructed, and which must be understood when processing the content.",
                "min": 0,
                "comments": "Asserting this rule set restricts the content to be only understood by a limited set of trading partners. This inherently limits the usefulness of the data in the long term. However, the existing health eco-system is highly fractured, and not yet ready to define, collect, and exchange data in a generally computable sense. Wherever possible, implementers and/or specification writers should avoid using this element as much as possible.",
                "short": "A set of rules under which this content was created",
                "type": [
                    {
                        "code": "uri"
                    }
                ],
                "isSummary": true,
                "isModifier": true
            },
            {
                "path": "NutritionOrder.language",
                "max": "1",
                "definition": "The base language in which the resource is written.",
                "min": 0,
                "comments": "Language is provided to support indexing and accessibility (typically, services such as text to speech use the language tag). The html language tag in the narrative applies  to the narrative. The language tag on the resource may be used to specify the language of other presentations generated from the data in the resource  Not all the content has to be in the base language. The Resource.language should not be assumed to apply to the narrative automatically. If a language is specified, it should it also be specified on the div element in the html (see rules in HTML5 for information about the relationship between xml:lang and the html lang attribute).",
                "short": "Language of the resource content",
                "type": [
                    {
                        "code": "code"
                    }
                ],
                "binding": {
                    "strength": "required",
                    "valueSetUri": "http://tools.ietf.org/html/bcp47",
                    "description": "A human language."
                }
            },
            {
                "path": "NutritionOrder.text",
                "max": "1",
                "definition": "A human-readable narrative that contains a summary of the resource, and may be used to represent the content of the resource to a human. The narrative need not encode all the structured data, but is required to contain sufficient detail to make it \"clinically safe\" for a human to just read the narrative. Resource definitions may define what content should be represented in the narrative to ensure clinical safety.",
                "min": 0,
                "condition": [
                    "dom-1"
                ],
                "comments": "Contained resources do not have narrative. Resources that are not contained SHOULD have a narrative.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "Act.text?"
                    }
                ],
                "short": "Text summary of the resource, for human interpretation",
                "type": [
                    {
                        "code": "Narrative"
                    }
                ],
                "alias": [
                    "narrative",
                    "html",
                    "xhtml",
                    "display"
                ]
            },
            {
                "path": "NutritionOrder.contained",
                "max": "*",
                "definition": "These resources do not have an independent existence apart from the resource that contains them - they cannot be identified independently, and nor can they have their own independent transaction scope.",
                "min": 0,
                "comments": "This should never be done when the content can be identified properly, as once identification is lost, it is extremely difficult (and context dependent) to restore it again.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "N/A"
                    }
                ],
                "short": "Contained, inline Resources",
                "type": [
                    {
                        "code": "Resource"
                    }
                ],
                "alias": [
                    "inline resources",
                    "anonymous resources",
                    "contained resources"
                ]
            },
            {
                "path": "NutritionOrder.extension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the resource. In order to make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.",
                "min": 0,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "N/A"
                    }
                ],
                "short": "Additional Content defined by implementations",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content"
                ]
            },
            {
                "path": "NutritionOrder.modifierExtension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the resource, and that modifies the understanding of the element that contains it. Usually modifier elements provide negation or qualification. In order to make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.",
                "min": 0,
                "isModifier": true,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "N/A"
                    }
                ],
                "short": "Extensions that cannot be ignored",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content"
                ]
            },
            {
                "path": "NutritionOrder.patient",
                "max": "1",
                "definition": "The person (patient) who needs the nutrition order for an oral diet, nutritional supplement and/or enteral or formula feeding.",
                "min": 1,
                "type": [
                    {
                        "code": "Reference",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/Patient"
                        ]
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".participation[typeCode=SBJ].role"
                    },
                    {
                        "identity": "w5",
                        "map": "who.focus"
                    }
                ],
                "short": "The person who requires the diet, formula or nutritional supplement",
                "isSummary": true
            },
            {
                "path": "NutritionOrder.orderer",
                "max": "1",
                "definition": "The practitioner that holds legal responsibility for ordering the diet, nutritional supplement, or formula feedings.",
                "min": 0,
                "type": [
                    {
                        "code": "Reference",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/Practitioner"
                        ]
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".participation[typeCode=AUT].role"
                    },
                    {
                        "identity": "w5",
                        "map": "who.author"
                    }
                ],
                "short": "Who ordered the diet, formula or nutritional supplement",
                "isSummary": true
            },
            {
                "path": "NutritionOrder.identifier",
                "max": "*",
                "definition": "Identifiers assigned to this order by the order sender or by the order receiver.",
                "min": 0,
                "type": [
                    {
                        "code": "Identifier"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".id"
                    },
                    {
                        "identity": "w5",
                        "map": "id"
                    }
                ],
                "short": "Identifiers assigned to this order"
            },
            {
                "path": "NutritionOrder.encounter",
                "max": "1",
                "definition": "An encounter that provides additional information about the healthcare context in which this request is made.",
                "min": 0,
                "type": [
                    {
                        "code": "Reference",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/Encounter"
                        ]
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".inboundRelationship[typeCode=COMP].source[classCode=ENC, moodCode=EVN]"
                    },
                    {
                        "identity": "w5",
                        "map": "context"
                    }
                ],
                "short": "The encounter associated with this nutrition order"
            },
            {
                "path": "NutritionOrder.dateTime",
                "max": "1",
                "definition": "The date and time that this nutrition order was requested.",
                "min": 1,
                "type": [
                    {
                        "code": "dateTime"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "author.time"
                    },
                    {
                        "identity": "w5",
                        "map": "when.recorded"
                    }
                ],
                "short": "Date and time the nutrition order was requested",
                "isSummary": true
            },
            {
                "path": "NutritionOrder.status",
                "max": "1",
                "definition": "The workflow status of the nutrition order/request.",
                "min": 0,
                "comments": "Typically the system placing the order sets the status to \"requested\". Thereafter, the order is maintained by the receiver that updates the status as the request is handled.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".statusCode"
                    },
                    {
                        "identity": "w5",
                        "map": "status"
                    }
                ],
                "short": "proposed | draft | planned | requested | active | on-hold | completed | cancelled",
                "type": [
                    {
                        "code": "code"
                    }
                ],
                "isSummary": true,
                "binding": {
                    "strength": "required",
                    "description": "Codes specifying the state of the request. Describes the lifecycle of the nutrition order.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/nutrition-order-status"
                    }
                },
                "isModifier": true
            },
            {
                "path": "NutritionOrder.allergyIntolerance",
                "max": "*",
                "definition": "A link to a record of allergies or intolerances  which should be included in the nutrition order.",
                "min": 0,
                "comments": "Information on a patient's food allergies and intolerances, inform healthcare personnel about the type of foods that the patient should receive or consume.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".outboundRelationship[typeCode=RSON].target[classCode=OBS, moodCode=EVN]"
                    }
                ],
                "short": "List of the patient's food and nutrition-related allergies and intolerances",
                "type": [
                    {
                        "code": "Reference",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/AllergyIntolerance"
                        ]
                    }
                ]
            },
            {
                "path": "NutritionOrder.foodPreferenceModifier",
                "max": "*",
                "definition": "This modifier is used to convey order-specific modifiers about the type of food that should be given. These can be derived from patient allergies, intolerances, or preferences such as Halal, Vegan or Kosher. This modifier applies to the entire nutrition order inclusive of the oral diet, nutritional supplements and enteral formula feedings.",
                "min": 0,
                "comments": "Information on a patient's food preferences that inform healthcare personnel about the food that the patient should receive or consume.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".outboundRelationship [typeCode =COMP], target [classCode=PROC, moodCode=EVN, code=NutritionModificationType]"
                    }
                ],
                "short": "Order-specific modifier about the type of food that should be given",
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "binding": {
                    "strength": "example",
                    "description": "Medical, cultural or ethical food preferences to help with catering requirements",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/encounter-diet"
                    }
                }
            },
            {
                "path": "NutritionOrder.excludeFoodModifier",
                "max": "*",
                "definition": "This modifier is used to convey order-specific modifiers about the type of food that should NOT be given. These can be derived from patient allergies, intolerances, or preferences such as No Red Meat, No Soy or No Wheat or  Gluten-Free.  While it should not be necessary to repeat allergy or intolerance information captured in the referenced allergyIntolerance resource in the excludeFoodModifier, this element may be used to convey additional specificity related to foods that should be eliminated from the patient’s diet for any reason.  This modifier applies to the entire nutrition order inclusive of the oral diet, nutritional supplements and enteral formula feedings.",
                "min": 0,
                "comments": "Information on a patient's food allergies and intolerances, and preferences inform healthcare personnel about the type  of foods that the patient should receive or consume.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "N/A"
                    }
                ],
                "short": "Order-specific modifier about the type of food that should not be given",
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "binding": {
                    "strength": "example",
                    "description": "Codes used to indicate the type of food that should NOT be given to the patient.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/food-type"
                    }
                }
            },
            {
                "path": "NutritionOrder.oralDiet",
                "max": "1",
                "definition": "Diet given orally in contrast to enteral (tube) feeding.",
                "min": 0,
                "condition": [
                    "nor-1"
                ],
                "type": [
                    {
                        "code": "BackboneElement"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "oralDiet .outboundRelationship [typeCode =COMP], target [classCode=SPLY, moodCode=RQO, code=OralDietSupplyType]"
                    }
                ],
                "short": "Oral diet components"
            },
            {
                "path": "NutritionOrder.oralDiet.id",
                "max": "1",
                "representation": [
                    "xmlAttr"
                ],
                "definition": "unique id for the element within a resource (for internal references).",
                "min": 0,
                "type": [
                    {
                        "code": "id"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "n/a"
                    }
                ],
                "short": "xml:id (or equivalent in JSON)"
            },
            {
                "path": "NutritionOrder.oralDiet.extension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the element. In order to make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.",
                "min": 0,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "n/a"
                    }
                ],
                "short": "Additional Content defined by implementations",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content"
                ]
            },
            {
                "path": "NutritionOrder.oralDiet.modifierExtension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the element, and that modifies the understanding of the element that contains it. Usually modifier elements provide negation or qualification. In order to make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.",
                "min": 0,
                "isModifier": true,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "N/A"
                    }
                ],
                "short": "Extensions that cannot be ignored",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content",
                    "modifiers"
                ]
            },
            {
                "path": "NutritionOrder.oralDiet.type",
                "max": "*",
                "definition": "The kind of diet or dietary restriction such as fiber restricted diet or diabetic diet.",
                "min": 0,
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".code"
                    }
                ],
                "short": "Type of oral diet or diet restrictions that describe what can be consumed orally",
                "isSummary": true,
                "binding": {
                    "strength": "example",
                    "description": "Codes used to indicate the type of diet being ordered for a patient.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/diet-type"
                    }
                }
            },
            {
                "path": "NutritionOrder.oralDiet.schedule",
                "max": "*",
                "definition": "The time period and frequency at which the diet should be given.",
                "min": 0,
                "type": [
                    {
                        "code": "Timing"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".expectedUseTime"
                    }
                ],
                "short": "Scheduled frequency of diet",
                "alias": [
                    "frequency"
                ]
            },
            {
                "path": "NutritionOrder.oralDiet.nutrient",
                "max": "*",
                "definition": "Class that defines the quantity and type of nutrient modifications required for the oral diet.",
                "min": 0,
                "type": [
                    {
                        "code": "BackboneElement"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".participation{typeCode=PRD].role{classCode=MANU), manufacturedFoodKind"
                    }
                ],
                "short": "Required  nutrient modifications"
            },
            {
                "path": "NutritionOrder.oralDiet.nutrient.id",
                "max": "1",
                "representation": [
                    "xmlAttr"
                ],
                "definition": "unique id for the element within a resource (for internal references).",
                "min": 0,
                "type": [
                    {
                        "code": "id"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "n/a"
                    }
                ],
                "short": "xml:id (or equivalent in JSON)"
            },
            {
                "path": "NutritionOrder.oralDiet.nutrient.extension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the element. In order to make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.",
                "min": 0,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "n/a"
                    }
                ],
                "short": "Additional Content defined by implementations",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content"
                ]
            },
            {
                "path": "NutritionOrder.oralDiet.nutrient.modifierExtension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the element, and that modifies the understanding of the element that contains it. Usually modifier elements provide negation or qualification. In order to make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.",
                "min": 0,
                "isModifier": true,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "N/A"
                    }
                ],
                "short": "Extensions that cannot be ignored",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content",
                    "modifiers"
                ]
            },
            {
                "path": "NutritionOrder.oralDiet.nutrient.modifier",
                "max": "1",
                "definition": "The nutrient that is being modified such as carbohydrate or sodium.",
                "min": 0,
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".code"
                    }
                ],
                "short": "Type of nutrient that is being modified",
                "binding": {
                    "strength": "example",
                    "description": "Codes for types of nutrient that is being modified such as carbohydrate or sodium.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/nutrient-code"
                    }
                }
            },
            {
                "path": "NutritionOrder.oralDiet.nutrient.amount",
                "max": "1",
                "definition": "The quantity of the specified nutrient to include in diet.",
                "min": 0,
                "type": [
                    {
                        "code": "Quantity",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/SimpleQuantity"
                        ]
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".quantity"
                    }
                ],
                "short": "Quantity of the specified nutrient"
            },
            {
                "path": "NutritionOrder.oralDiet.texture",
                "max": "*",
                "definition": "Class that describes any texture modifications required for the patient to safely consume various types of solid foods.",
                "min": 0,
                "type": [
                    {
                        "code": "BackboneElement"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".inboundRelationship [typeCode =COMP], target [classCode=PROC, moodCode=EVN, code=DietTextureModificationType]"
                    }
                ],
                "short": "Required  texture modifications"
            },
            {
                "path": "NutritionOrder.oralDiet.texture.id",
                "max": "1",
                "representation": [
                    "xmlAttr"
                ],
                "definition": "unique id for the element within a resource (for internal references).",
                "min": 0,
                "type": [
                    {
                        "code": "id"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "n/a"
                    }
                ],
                "short": "xml:id (or equivalent in JSON)"
            },
            {
                "path": "NutritionOrder.oralDiet.texture.extension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the element. In order to make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.",
                "min": 0,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "n/a"
                    }
                ],
                "short": "Additional Content defined by implementations",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content"
                ]
            },
            {
                "path": "NutritionOrder.oralDiet.texture.modifierExtension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the element, and that modifies the understanding of the element that contains it. Usually modifier elements provide negation or qualification. In order to make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.",
                "min": 0,
                "isModifier": true,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "N/A"
                    }
                ],
                "short": "Extensions that cannot be ignored",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content",
                    "modifiers"
                ]
            },
            {
                "path": "NutritionOrder.oralDiet.texture.modifier",
                "max": "1",
                "definition": "Any texture modifications (for solid foods) that should be made, e.g. easy to chew, chopped, ground, and pureed.",
                "min": 0,
                "comments": "Coupled with the foodType (Meat).",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".code"
                    }
                ],
                "short": "Code to indicate how to alter the texture of the foods, e.g. pureed",
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "binding": {
                    "strength": "example",
                    "description": "Codes for food consistency types or texture modifications to apply to foods.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/texture-code"
                    }
                }
            },
            {
                "path": "NutritionOrder.oralDiet.texture.foodType",
                "max": "1",
                "definition": "The food type(s) (e.g. meats, all foods)  that the texture modification applies to.  This could be all foods types.",
                "min": 0,
                "comments": "Coupled with the textureModifier; could be (All Foods).",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".participation{typeCode=PRD].role{classCode=MANU), manufacturedFoodKind; .code"
                    }
                ],
                "short": "Concepts that are used to identify an entity that is ingested for nutritional purposes",
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "binding": {
                    "strength": "example",
                    "description": "Codes for types of foods that are texture modified.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/modified-foodtype"
                    }
                }
            },
            {
                "path": "NutritionOrder.oralDiet.fluidConsistencyType",
                "max": "*",
                "definition": "The required consistency (e.g. honey-thick, nectar-thick, thin, thickened.) of liquids or fluids served to the patient.",
                "min": 0,
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".code  (Not differentiated from dietTextureModificationType in HL7 v3)"
                    }
                ],
                "short": "The required consistency of fluids and liquids provided to the patient",
                "binding": {
                    "strength": "example",
                    "description": "Codes used to represent the consistency of fluids and liquids provided to the patient.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/consistency-type"
                    }
                }
            },
            {
                "path": "NutritionOrder.oralDiet.instruction",
                "max": "1",
                "definition": "Free text or additional instructions or information pertaining to the oral diet.",
                "min": 0,
                "comments": "Free text dosage instructions can be used for cases where the instructions are too complex to code.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".text"
                    }
                ],
                "short": "Instructions or additional information about the oral diet",
                "type": [
                    {
                        "code": "string"
                    }
                ],
                "isSummary": true
            },
            {
                "path": "NutritionOrder.supplement",
                "max": "*",
                "definition": "Oral nutritional products given in order to add further nutritional value to the patient's diet.",
                "min": 0,
                "condition": [
                    "nor-1"
                ],
                "type": [
                    {
                        "code": "BackboneElement"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".outboundRelationship [typeCode =COMP], target [classCode=SPLY, moodCode=RQO, code=SUPPLEMENT]"
                    }
                ],
                "short": "Supplement components"
            },
            {
                "path": "NutritionOrder.supplement.id",
                "max": "1",
                "representation": [
                    "xmlAttr"
                ],
                "definition": "unique id for the element within a resource (for internal references).",
                "min": 0,
                "type": [
                    {
                        "code": "id"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "n/a"
                    }
                ],
                "short": "xml:id (or equivalent in JSON)"
            },
            {
                "path": "NutritionOrder.supplement.extension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the element. In order to make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.",
                "min": 0,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "n/a"
                    }
                ],
                "short": "Additional Content defined by implementations",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content"
                ]
            },
            {
                "path": "NutritionOrder.supplement.modifierExtension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the element, and that modifies the understanding of the element that contains it. Usually modifier elements provide negation or qualification. In order to make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.",
                "min": 0,
                "isModifier": true,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "N/A"
                    }
                ],
                "short": "Extensions that cannot be ignored",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content",
                    "modifiers"
                ]
            },
            {
                "path": "NutritionOrder.supplement.type",
                "max": "1",
                "definition": "The kind of nutritional supplement product required such as a high protein or pediatric clear liquid supplement.",
                "min": 0,
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".participation{typeCode=PRD].role{classCode=MANU), manufacturedFoodKind; .code (NutritionalSupplementType)"
                    }
                ],
                "short": "Type of supplement product requested",
                "isSummary": true,
                "binding": {
                    "strength": "example",
                    "description": "Codes for nutritional supplements to be provided to the patient",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/supplement-type"
                    }
                }
            },
            {
                "path": "NutritionOrder.supplement.productName",
                "max": "1",
                "definition": "The product or brand name of the nutritional supplement such as \"Acme Protein Shake\".",
                "min": 0,
                "type": [
                    {
                        "code": "string"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".id"
                    }
                ],
                "short": "Product or brand name of the nutritional supplement"
            },
            {
                "path": "NutritionOrder.supplement.schedule",
                "max": "*",
                "definition": "The time period and frequency at which the supplement(s) should be given.",
                "min": 0,
                "type": [
                    {
                        "code": "Timing"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".effectiveTime"
                    }
                ],
                "short": "Scheduled frequency of supplement",
                "alias": [
                    "frequency"
                ]
            },
            {
                "path": "NutritionOrder.supplement.quantity",
                "max": "1",
                "definition": "The amount of the nutritional supplement to be given.",
                "min": 0,
                "type": [
                    {
                        "code": "Quantity",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/SimpleQuantity"
                        ]
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".quantity"
                    }
                ],
                "short": "Amount of the nutritional supplement"
            },
            {
                "path": "NutritionOrder.supplement.instruction",
                "max": "1",
                "definition": "Free text or additional instructions or information pertaining to the oral supplement.",
                "min": 0,
                "comments": "Free text dosage instructions can be used for cases where the instructions are too complex to code.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".text"
                    }
                ],
                "short": "Instructions or additional information about the oral supplement",
                "type": [
                    {
                        "code": "string"
                    }
                ],
                "isSummary": true
            },
            {
                "path": "NutritionOrder.enteralFormula",
                "max": "1",
                "definition": "Feeding provided through the gastrointestinal tract via a tube, catheter, or stoma that delivers nutrition distal to the oral cavity.",
                "min": 0,
                "condition": [
                    "nor-1"
                ],
                "type": [
                    {
                        "code": "BackboneElement"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".outboundRelationship [typeCode =COMP], target [classCode=SPLY, moodCode=RQO, code=FORMULA]"
                    }
                ],
                "short": "Enteral formula components"
            },
            {
                "path": "NutritionOrder.enteralFormula.id",
                "max": "1",
                "representation": [
                    "xmlAttr"
                ],
                "definition": "unique id for the element within a resource (for internal references).",
                "min": 0,
                "type": [
                    {
                        "code": "id"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "n/a"
                    }
                ],
                "short": "xml:id (or equivalent in JSON)"
            },
            {
                "path": "NutritionOrder.enteralFormula.extension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the element. In order to make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.",
                "min": 0,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "n/a"
                    }
                ],
                "short": "Additional Content defined by implementations",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content"
                ]
            },
            {
                "path": "NutritionOrder.enteralFormula.modifierExtension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the element, and that modifies the understanding of the element that contains it. Usually modifier elements provide negation or qualification. In order to make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.",
                "min": 0,
                "isModifier": true,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "N/A"
                    }
                ],
                "short": "Extensions that cannot be ignored",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content",
                    "modifiers"
                ]
            },
            {
                "path": "NutritionOrder.enteralFormula.baseFormulaType",
                "max": "1",
                "definition": "The type of enteral or infant formula such as an adult standard formula with fiber or a soy-based infant formula.",
                "min": 0,
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".participation{typeCode=PRD].role{classCode=MANU), manufacturedFoodKind; .code (NutritionalFormulaType)"
                    }
                ],
                "short": "Type of enteral or infant formula",
                "isSummary": true,
                "binding": {
                    "strength": "example",
                    "description": "Codes for type of enteral formula to be administered to patient.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/entformula-type"
                    }
                }
            },
            {
                "path": "NutritionOrder.enteralFormula.baseFormulaProductName",
                "max": "1",
                "definition": "The product or brand name of the enteral or infant formula product such as \"ACME Adult Standard Formula\".",
                "min": 0,
                "type": [
                    {
                        "code": "string"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".id"
                    }
                ],
                "short": "Product or brand name of the enteral or infant formula"
            },
            {
                "path": "NutritionOrder.enteralFormula.additiveType",
                "max": "1",
                "definition": "Indicates the type of modular component such as protein, carbohydrate, fat or fiber to be provided in addition to or mixed with the base formula.",
                "min": 0,
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "N/A (not differentiated from NutritionalFormulaType in HL7 v3)"
                    }
                ],
                "short": "Type of modular component to add to the feeding",
                "binding": {
                    "strength": "example",
                    "description": "Codes for the type of modular component such as protein, carbohydrate or fiber to be provided in addition to or mixed with the base formula.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/entformula-additive"
                    }
                }
            },
            {
                "path": "NutritionOrder.enteralFormula.additiveProductName",
                "max": "1",
                "definition": "The product or brand name of the type of modular component to be added to the formula.",
                "min": 0,
                "type": [
                    {
                        "code": "string"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "N/A"
                    }
                ],
                "short": "Product or brand name of the modular additive"
            },
            {
                "path": "NutritionOrder.enteralFormula.caloricDensity",
                "max": "1",
                "definition": "The amount of energy (Calories) that the formula should provide per specified volume, typically per mL or fluid oz.  For example, an infant may require a formula that provides 24 Calories per fluid ounce or an adult may require an enteral formula that provides 1.5 Calorie/mL.",
                "min": 0,
                "type": [
                    {
                        "code": "Quantity",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/SimpleQuantity"
                        ]
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".quantity (caloricDensity)"
                    }
                ],
                "short": "Amount of energy per specified volume that is required"
            },
            {
                "path": "NutritionOrder.enteralFormula.routeofAdministration",
                "max": "1",
                "definition": "The route or physiological path of administration into the patient's gastrointestinal  tract for purposes of providing the formula feeding, e.g. nasogastric tube.",
                "min": 0,
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".routeCode"
                    }
                ],
                "short": "How the formula should enter the patient's gastrointestinal tract",
                "binding": {
                    "strength": "extensible",
                    "description": "Codes specifying the route of administration of enteral formula.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/enteral-route"
                    }
                }
            },
            {
                "path": "NutritionOrder.enteralFormula.administration",
                "max": "*",
                "definition": "Formula administration instructions as structured data.  This repeating structure allows for changing the administration rate or volume over time for both bolus and continuous feeding.  An example of this would be an instruction to increase the rate of continuous feeding every 2 hours.",
                "min": 0,
                "comments": "See implementation notes below for further discussion on how to order continuous vs bolus enteral feeding using this resource.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".outboundRelationship [typeCode =COMP], target [classCode=SBADM, moodCode=RQO]"
                    }
                ],
                "short": "Formula feeding instruction as structured data",
                "type": [
                    {
                        "code": "BackboneElement"
                    }
                ]
            },
            {
                "path": "NutritionOrder.enteralFormula.administration.id",
                "max": "1",
                "representation": [
                    "xmlAttr"
                ],
                "definition": "unique id for the element within a resource (for internal references).",
                "min": 0,
                "type": [
                    {
                        "code": "id"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "n/a"
                    }
                ],
                "short": "xml:id (or equivalent in JSON)"
            },
            {
                "path": "NutritionOrder.enteralFormula.administration.extension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the element. In order to make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.",
                "min": 0,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "n/a"
                    }
                ],
                "short": "Additional Content defined by implementations",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content"
                ]
            },
            {
                "path": "NutritionOrder.enteralFormula.administration.modifierExtension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the element, and that modifies the understanding of the element that contains it. Usually modifier elements provide negation or qualification. In order to make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.",
                "min": 0,
                "isModifier": true,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "N/A"
                    }
                ],
                "short": "Extensions that cannot be ignored",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content",
                    "modifiers"
                ]
            },
            {
                "path": "NutritionOrder.enteralFormula.administration.schedule",
                "max": "1",
                "definition": "The time period and frequency at which the enteral formula should be delivered to the patient.",
                "min": 0,
                "type": [
                    {
                        "code": "Timing"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".effectiveUseTime"
                    }
                ],
                "short": "Scheduled frequency of enteral feeding",
                "alias": [
                    "frequency"
                ]
            },
            {
                "path": "NutritionOrder.enteralFormula.administration.quantity",
                "max": "1",
                "definition": "The volume of formula to provide to the patient per the specified administration schedule.",
                "min": 0,
                "type": [
                    {
                        "code": "Quantity",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/SimpleQuantity"
                        ]
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".doseQuantity"
                    }
                ],
                "short": "The volume of formula to provide"
            },
            {
                "path": "NutritionOrder.enteralFormula.administration.rate[x]",
                "max": "1",
                "definition": "The rate of administration of formula via a feeding pump, e.g. 60 mL per hour, according to the specified schedule.",
                "min": 0,
                "comments": "Ratio is used when the quantity value in the denominator is not \"1\", otherwise use Quantity. For example, the Ratio datatype is used for \"200 mL/4 hrs\" versus the Quantity datatype for \"50 mL/hr\".",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".rateQuantity"
                    }
                ],
                "short": "Speed with which the formula is provided per period of time",
                "type": [
                    {
                        "code": "Quantity",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/SimpleQuantity"
                        ]
                    },
                    {
                        "code": "Ratio"
                    }
                ]
            },
            {
                "path": "NutritionOrder.enteralFormula.maxVolumeToDeliver",
                "max": "1",
                "definition": "The maximum total quantity of formula that may be administered to a subject over the period of time, e.g. 1440 mL over 24 hours.",
                "min": 0,
                "type": [
                    {
                        "code": "Quantity",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/SimpleQuantity"
                        ]
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".maxDoseQuantity"
                    }
                ],
                "short": "Upper limit on formula volume per unit of time"
            },
            {
                "path": "NutritionOrder.enteralFormula.administrationInstruction",
                "max": "1",
                "definition": "Free text formula administration, feeding instructions or additional instructions or information.",
                "min": 0,
                "comments": "Free text dosage instructions can be used for cases where the instructions are too complex to code.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "N/A"
                    }
                ],
                "short": "Formula feeding instructions expressed as text",
                "type": [
                    {
                        "code": "string"
                    }
                ],
                "isSummary": true
            }
        ]
    },
    "publisher": "Health Level Seven International (Orders and Observations)",
    "abstract": false,
    "extension": [
        {
            "valueInteger": 1,
            "url": "http://hl7.org/fhir/StructureDefinition/structuredefinition-fmm"
        }
    ],
    "differential": {
        "element": [
            {
                "path": "NutritionOrder",
                "max": "*",
                "definition": "A request to supply a diet, formula feeding (enteral) or oral nutritional supplement to a patient/resident.",
                "min": 0,
                "comments": "Referenced by an Order Request (workflow).",
                "constraint": [
                    {
                        "key": "nor-1",
                        "severity": "warning",
                        "xpath": "exists(f:oralDiet) or exists(f:supplement) or exists(f:enteralFormula)",
                        "human": "Nutrition Order SHALL contain either Oral Diet , Supplement, or Enteral Formula class"
                    }
                ],
                "short": "A request for a diet, formula or nutritional supplement",
                "type": [
                    {
                        "code": "DomainResource"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "SupplyRequest"
                    },
                    {
                        "identity": "w5",
                        "map": "clinical.careprovision"
                    }
                ],
                "alias": [
                    "Diet Order",
                    "Diet",
                    "Nutritional Supplement",
                    "Enteral Nutrition"
                ]
            },
            {
                "path": "NutritionOrder.patient",
                "max": "1",
                "definition": "The person (patient) who needs the nutrition order for an oral diet, nutritional supplement and/or enteral or formula feeding.",
                "min": 1,
                "type": [
                    {
                        "code": "Reference",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/Patient"
                        ]
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".participation[typeCode=SBJ].role"
                    },
                    {
                        "identity": "w5",
                        "map": "who.focus"
                    }
                ],
                "short": "The person who requires the diet, formula or nutritional supplement",
                "isSummary": true
            },
            {
                "path": "NutritionOrder.orderer",
                "max": "1",
                "definition": "The practitioner that holds legal responsibility for ordering the diet, nutritional supplement, or formula feedings.",
                "min": 0,
                "type": [
                    {
                        "code": "Reference",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/Practitioner"
                        ]
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".participation[typeCode=AUT].role"
                    },
                    {
                        "identity": "w5",
                        "map": "who.author"
                    }
                ],
                "short": "Who ordered the diet, formula or nutritional supplement",
                "isSummary": true
            },
            {
                "path": "NutritionOrder.identifier",
                "max": "*",
                "definition": "Identifiers assigned to this order by the order sender or by the order receiver.",
                "min": 0,
                "type": [
                    {
                        "code": "Identifier"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".id"
                    },
                    {
                        "identity": "w5",
                        "map": "id"
                    }
                ],
                "short": "Identifiers assigned to this order"
            },
            {
                "path": "NutritionOrder.encounter",
                "max": "1",
                "definition": "An encounter that provides additional information about the healthcare context in which this request is made.",
                "min": 0,
                "type": [
                    {
                        "code": "Reference",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/Encounter"
                        ]
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".inboundRelationship[typeCode=COMP].source[classCode=ENC, moodCode=EVN]"
                    },
                    {
                        "identity": "w5",
                        "map": "context"
                    }
                ],
                "short": "The encounter associated with this nutrition order"
            },
            {
                "path": "NutritionOrder.dateTime",
                "max": "1",
                "definition": "The date and time that this nutrition order was requested.",
                "min": 1,
                "type": [
                    {
                        "code": "dateTime"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "author.time"
                    },
                    {
                        "identity": "w5",
                        "map": "when.recorded"
                    }
                ],
                "short": "Date and time the nutrition order was requested",
                "isSummary": true
            },
            {
                "path": "NutritionOrder.status",
                "max": "1",
                "definition": "The workflow status of the nutrition order/request.",
                "min": 0,
                "comments": "Typically the system placing the order sets the status to \"requested\". Thereafter, the order is maintained by the receiver that updates the status as the request is handled.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".statusCode"
                    },
                    {
                        "identity": "w5",
                        "map": "status"
                    }
                ],
                "short": "proposed | draft | planned | requested | active | on-hold | completed | cancelled",
                "type": [
                    {
                        "code": "code"
                    }
                ],
                "isSummary": true,
                "binding": {
                    "strength": "required",
                    "description": "Codes specifying the state of the request. Describes the lifecycle of the nutrition order.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/nutrition-order-status"
                    }
                },
                "isModifier": true
            },
            {
                "path": "NutritionOrder.allergyIntolerance",
                "max": "*",
                "definition": "A link to a record of allergies or intolerances  which should be included in the nutrition order.",
                "min": 0,
                "comments": "Information on a patient's food allergies and intolerances, inform healthcare personnel about the type of foods that the patient should receive or consume.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".outboundRelationship[typeCode=RSON].target[classCode=OBS, moodCode=EVN]"
                    }
                ],
                "short": "List of the patient's food and nutrition-related allergies and intolerances",
                "type": [
                    {
                        "code": "Reference",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/AllergyIntolerance"
                        ]
                    }
                ]
            },
            {
                "path": "NutritionOrder.foodPreferenceModifier",
                "max": "*",
                "definition": "This modifier is used to convey order-specific modifiers about the type of food that should be given. These can be derived from patient allergies, intolerances, or preferences such as Halal, Vegan or Kosher. This modifier applies to the entire nutrition order inclusive of the oral diet, nutritional supplements and enteral formula feedings.",
                "min": 0,
                "comments": "Information on a patient's food preferences that inform healthcare personnel about the food that the patient should receive or consume.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".outboundRelationship [typeCode =COMP], target [classCode=PROC, moodCode=EVN, code=NutritionModificationType]"
                    }
                ],
                "short": "Order-specific modifier about the type of food that should be given",
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "binding": {
                    "strength": "example",
                    "description": "Medical, cultural or ethical food preferences to help with catering requirements",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/encounter-diet"
                    }
                }
            },
            {
                "path": "NutritionOrder.excludeFoodModifier",
                "max": "*",
                "definition": "This modifier is used to convey order-specific modifiers about the type of food that should NOT be given. These can be derived from patient allergies, intolerances, or preferences such as No Red Meat, No Soy or No Wheat or  Gluten-Free.  While it should not be necessary to repeat allergy or intolerance information captured in the referenced allergyIntolerance resource in the excludeFoodModifier, this element may be used to convey additional specificity related to foods that should be eliminated from the patient’s diet for any reason.  This modifier applies to the entire nutrition order inclusive of the oral diet, nutritional supplements and enteral formula feedings.",
                "min": 0,
                "comments": "Information on a patient's food allergies and intolerances, and preferences inform healthcare personnel about the type  of foods that the patient should receive or consume.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "N/A"
                    }
                ],
                "short": "Order-specific modifier about the type of food that should not be given",
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "binding": {
                    "strength": "example",
                    "description": "Codes used to indicate the type of food that should NOT be given to the patient.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/food-type"
                    }
                }
            },
            {
                "path": "NutritionOrder.oralDiet",
                "max": "1",
                "definition": "Diet given orally in contrast to enteral (tube) feeding.",
                "min": 0,
                "condition": [
                    "nor-1"
                ],
                "type": [
                    {
                        "code": "BackboneElement"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "oralDiet .outboundRelationship [typeCode =COMP], target [classCode=SPLY, moodCode=RQO, code=OralDietSupplyType]"
                    }
                ],
                "short": "Oral diet components"
            },
            {
                "path": "NutritionOrder.oralDiet.type",
                "max": "*",
                "definition": "The kind of diet or dietary restriction such as fiber restricted diet or diabetic diet.",
                "min": 0,
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".code"
                    }
                ],
                "short": "Type of oral diet or diet restrictions that describe what can be consumed orally",
                "isSummary": true,
                "binding": {
                    "strength": "example",
                    "description": "Codes used to indicate the type of diet being ordered for a patient.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/diet-type"
                    }
                }
            },
            {
                "path": "NutritionOrder.oralDiet.schedule",
                "max": "*",
                "definition": "The time period and frequency at which the diet should be given.",
                "min": 0,
                "type": [
                    {
                        "code": "Timing"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".expectedUseTime"
                    }
                ],
                "short": "Scheduled frequency of diet",
                "alias": [
                    "frequency"
                ]
            },
            {
                "path": "NutritionOrder.oralDiet.nutrient",
                "max": "*",
                "definition": "Class that defines the quantity and type of nutrient modifications required for the oral diet.",
                "min": 0,
                "type": [
                    {
                        "code": "BackboneElement"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".participation{typeCode=PRD].role{classCode=MANU), manufacturedFoodKind"
                    }
                ],
                "short": "Required  nutrient modifications"
            },
            {
                "path": "NutritionOrder.oralDiet.nutrient.modifier",
                "max": "1",
                "definition": "The nutrient that is being modified such as carbohydrate or sodium.",
                "min": 0,
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".code"
                    }
                ],
                "short": "Type of nutrient that is being modified",
                "binding": {
                    "strength": "example",
                    "description": "Codes for types of nutrient that is being modified such as carbohydrate or sodium.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/nutrient-code"
                    }
                }
            },
            {
                "path": "NutritionOrder.oralDiet.nutrient.amount",
                "max": "1",
                "definition": "The quantity of the specified nutrient to include in diet.",
                "min": 0,
                "type": [
                    {
                        "code": "Quantity",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/SimpleQuantity"
                        ]
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".quantity"
                    }
                ],
                "short": "Quantity of the specified nutrient"
            },
            {
                "path": "NutritionOrder.oralDiet.texture",
                "max": "*",
                "definition": "Class that describes any texture modifications required for the patient to safely consume various types of solid foods.",
                "min": 0,
                "type": [
                    {
                        "code": "BackboneElement"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".inboundRelationship [typeCode =COMP], target [classCode=PROC, moodCode=EVN, code=DietTextureModificationType]"
                    }
                ],
                "short": "Required  texture modifications"
            },
            {
                "path": "NutritionOrder.oralDiet.texture.modifier",
                "max": "1",
                "definition": "Any texture modifications (for solid foods) that should be made, e.g. easy to chew, chopped, ground, and pureed.",
                "min": 0,
                "comments": "Coupled with the foodType (Meat).",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".code"
                    }
                ],
                "short": "Code to indicate how to alter the texture of the foods, e.g. pureed",
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "binding": {
                    "strength": "example",
                    "description": "Codes for food consistency types or texture modifications to apply to foods.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/texture-code"
                    }
                }
            },
            {
                "path": "NutritionOrder.oralDiet.texture.foodType",
                "max": "1",
                "definition": "The food type(s) (e.g. meats, all foods)  that the texture modification applies to.  This could be all foods types.",
                "min": 0,
                "comments": "Coupled with the textureModifier; could be (All Foods).",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".participation{typeCode=PRD].role{classCode=MANU), manufacturedFoodKind; .code"
                    }
                ],
                "short": "Concepts that are used to identify an entity that is ingested for nutritional purposes",
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "binding": {
                    "strength": "example",
                    "description": "Codes for types of foods that are texture modified.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/modified-foodtype"
                    }
                }
            },
            {
                "path": "NutritionOrder.oralDiet.fluidConsistencyType",
                "max": "*",
                "definition": "The required consistency (e.g. honey-thick, nectar-thick, thin, thickened.) of liquids or fluids served to the patient.",
                "min": 0,
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".code  (Not differentiated from dietTextureModificationType in HL7 v3)"
                    }
                ],
                "short": "The required consistency of fluids and liquids provided to the patient",
                "binding": {
                    "strength": "example",
                    "description": "Codes used to represent the consistency of fluids and liquids provided to the patient.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/consistency-type"
                    }
                }
            },
            {
                "path": "NutritionOrder.oralDiet.instruction",
                "max": "1",
                "definition": "Free text or additional instructions or information pertaining to the oral diet.",
                "min": 0,
                "comments": "Free text dosage instructions can be used for cases where the instructions are too complex to code.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".text"
                    }
                ],
                "short": "Instructions or additional information about the oral diet",
                "type": [
                    {
                        "code": "string"
                    }
                ],
                "isSummary": true
            },
            {
                "path": "NutritionOrder.supplement",
                "max": "*",
                "definition": "Oral nutritional products given in order to add further nutritional value to the patient's diet.",
                "min": 0,
                "condition": [
                    "nor-1"
                ],
                "type": [
                    {
                        "code": "BackboneElement"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".outboundRelationship [typeCode =COMP], target [classCode=SPLY, moodCode=RQO, code=SUPPLEMENT]"
                    }
                ],
                "short": "Supplement components"
            },
            {
                "path": "NutritionOrder.supplement.type",
                "max": "1",
                "definition": "The kind of nutritional supplement product required such as a high protein or pediatric clear liquid supplement.",
                "min": 0,
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".participation{typeCode=PRD].role{classCode=MANU), manufacturedFoodKind; .code (NutritionalSupplementType)"
                    }
                ],
                "short": "Type of supplement product requested",
                "isSummary": true,
                "binding": {
                    "strength": "example",
                    "description": "Codes for nutritional supplements to be provided to the patient",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/supplement-type"
                    }
                }
            },
            {
                "path": "NutritionOrder.supplement.productName",
                "max": "1",
                "definition": "The product or brand name of the nutritional supplement such as \"Acme Protein Shake\".",
                "min": 0,
                "type": [
                    {
                        "code": "string"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".id"
                    }
                ],
                "short": "Product or brand name of the nutritional supplement"
            },
            {
                "path": "NutritionOrder.supplement.schedule",
                "max": "*",
                "definition": "The time period and frequency at which the supplement(s) should be given.",
                "min": 0,
                "type": [
                    {
                        "code": "Timing"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".effectiveTime"
                    }
                ],
                "short": "Scheduled frequency of supplement",
                "alias": [
                    "frequency"
                ]
            },
            {
                "path": "NutritionOrder.supplement.quantity",
                "max": "1",
                "definition": "The amount of the nutritional supplement to be given.",
                "min": 0,
                "type": [
                    {
                        "code": "Quantity",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/SimpleQuantity"
                        ]
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".quantity"
                    }
                ],
                "short": "Amount of the nutritional supplement"
            },
            {
                "path": "NutritionOrder.supplement.instruction",
                "max": "1",
                "definition": "Free text or additional instructions or information pertaining to the oral supplement.",
                "min": 0,
                "comments": "Free text dosage instructions can be used for cases where the instructions are too complex to code.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".text"
                    }
                ],
                "short": "Instructions or additional information about the oral supplement",
                "type": [
                    {
                        "code": "string"
                    }
                ],
                "isSummary": true
            },
            {
                "path": "NutritionOrder.enteralFormula",
                "max": "1",
                "definition": "Feeding provided through the gastrointestinal tract via a tube, catheter, or stoma that delivers nutrition distal to the oral cavity.",
                "min": 0,
                "condition": [
                    "nor-1"
                ],
                "type": [
                    {
                        "code": "BackboneElement"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".outboundRelationship [typeCode =COMP], target [classCode=SPLY, moodCode=RQO, code=FORMULA]"
                    }
                ],
                "short": "Enteral formula components"
            },
            {
                "path": "NutritionOrder.enteralFormula.baseFormulaType",
                "max": "1",
                "definition": "The type of enteral or infant formula such as an adult standard formula with fiber or a soy-based infant formula.",
                "min": 0,
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".participation{typeCode=PRD].role{classCode=MANU), manufacturedFoodKind; .code (NutritionalFormulaType)"
                    }
                ],
                "short": "Type of enteral or infant formula",
                "isSummary": true,
                "binding": {
                    "strength": "example",
                    "description": "Codes for type of enteral formula to be administered to patient.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/entformula-type"
                    }
                }
            },
            {
                "path": "NutritionOrder.enteralFormula.baseFormulaProductName",
                "max": "1",
                "definition": "The product or brand name of the enteral or infant formula product such as \"ACME Adult Standard Formula\".",
                "min": 0,
                "type": [
                    {
                        "code": "string"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".id"
                    }
                ],
                "short": "Product or brand name of the enteral or infant formula"
            },
            {
                "path": "NutritionOrder.enteralFormula.additiveType",
                "max": "1",
                "definition": "Indicates the type of modular component such as protein, carbohydrate, fat or fiber to be provided in addition to or mixed with the base formula.",
                "min": 0,
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "N/A (not differentiated from NutritionalFormulaType in HL7 v3)"
                    }
                ],
                "short": "Type of modular component to add to the feeding",
                "binding": {
                    "strength": "example",
                    "description": "Codes for the type of modular component such as protein, carbohydrate or fiber to be provided in addition to or mixed with the base formula.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/entformula-additive"
                    }
                }
            },
            {
                "path": "NutritionOrder.enteralFormula.additiveProductName",
                "max": "1",
                "definition": "The product or brand name of the type of modular component to be added to the formula.",
                "min": 0,
                "type": [
                    {
                        "code": "string"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "N/A"
                    }
                ],
                "short": "Product or brand name of the modular additive"
            },
            {
                "path": "NutritionOrder.enteralFormula.caloricDensity",
                "max": "1",
                "definition": "The amount of energy (Calories) that the formula should provide per specified volume, typically per mL or fluid oz.  For example, an infant may require a formula that provides 24 Calories per fluid ounce or an adult may require an enteral formula that provides 1.5 Calorie/mL.",
                "min": 0,
                "type": [
                    {
                        "code": "Quantity",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/SimpleQuantity"
                        ]
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".quantity (caloricDensity)"
                    }
                ],
                "short": "Amount of energy per specified volume that is required"
            },
            {
                "path": "NutritionOrder.enteralFormula.routeofAdministration",
                "max": "1",
                "definition": "The route or physiological path of administration into the patient's gastrointestinal  tract for purposes of providing the formula feeding, e.g. nasogastric tube.",
                "min": 0,
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".routeCode"
                    }
                ],
                "short": "How the formula should enter the patient's gastrointestinal tract",
                "binding": {
                    "strength": "extensible",
                    "description": "Codes specifying the route of administration of enteral formula.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/enteral-route"
                    }
                }
            },
            {
                "path": "NutritionOrder.enteralFormula.administration",
                "max": "*",
                "definition": "Formula administration instructions as structured data.  This repeating structure allows for changing the administration rate or volume over time for both bolus and continuous feeding.  An example of this would be an instruction to increase the rate of continuous feeding every 2 hours.",
                "min": 0,
                "comments": "See implementation notes below for further discussion on how to order continuous vs bolus enteral feeding using this resource.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".outboundRelationship [typeCode =COMP], target [classCode=SBADM, moodCode=RQO]"
                    }
                ],
                "short": "Formula feeding instruction as structured data",
                "type": [
                    {
                        "code": "BackboneElement"
                    }
                ]
            },
            {
                "path": "NutritionOrder.enteralFormula.administration.schedule",
                "max": "1",
                "definition": "The time period and frequency at which the enteral formula should be delivered to the patient.",
                "min": 0,
                "type": [
                    {
                        "code": "Timing"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".effectiveUseTime"
                    }
                ],
                "short": "Scheduled frequency of enteral feeding",
                "alias": [
                    "frequency"
                ]
            },
            {
                "path": "NutritionOrder.enteralFormula.administration.quantity",
                "max": "1",
                "definition": "The volume of formula to provide to the patient per the specified administration schedule.",
                "min": 0,
                "type": [
                    {
                        "code": "Quantity",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/SimpleQuantity"
                        ]
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".doseQuantity"
                    }
                ],
                "short": "The volume of formula to provide"
            },
            {
                "path": "NutritionOrder.enteralFormula.administration.rate[x]",
                "max": "1",
                "definition": "The rate of administration of formula via a feeding pump, e.g. 60 mL per hour, according to the specified schedule.",
                "min": 0,
                "comments": "Ratio is used when the quantity value in the denominator is not \"1\", otherwise use Quantity. For example, the Ratio datatype is used for \"200 mL/4 hrs\" versus the Quantity datatype for \"50 mL/hr\".",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".rateQuantity"
                    }
                ],
                "short": "Speed with which the formula is provided per period of time",
                "type": [
                    {
                        "code": "Quantity",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/SimpleQuantity"
                        ]
                    },
                    {
                        "code": "Ratio"
                    }
                ]
            },
            {
                "path": "NutritionOrder.enteralFormula.maxVolumeToDeliver",
                "max": "1",
                "definition": "The maximum total quantity of formula that may be administered to a subject over the period of time, e.g. 1440 mL over 24 hours.",
                "min": 0,
                "type": [
                    {
                        "code": "Quantity",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/SimpleQuantity"
                        ]
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": ".maxDoseQuantity"
                    }
                ],
                "short": "Upper limit on formula volume per unit of time"
            },
            {
                "path": "NutritionOrder.enteralFormula.administrationInstruction",
                "max": "1",
                "definition": "Free text formula administration, feeding instructions or additional instructions or information.",
                "min": 0,
                "comments": "Free text dosage instructions can be used for cases where the instructions are too complex to code.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "N/A"
                    }
                ],
                "short": "Formula feeding instructions expressed as text",
                "type": [
                    {
                        "code": "string"
                    }
                ],
                "isSummary": true
            }
        ]
    },
    "resourceType": "StructureDefinition",
    "description": "Base StructureDefinition for NutritionOrder Resource",
    "url": "http://hl7.org/fhir/StructureDefinition/NutritionOrder",
    "kind": "resource",
    "contact": [
        {
            "telecom": [
                {
                    "system": "other",
                    "value": "http://hl7.org/fhir"
                }
            ]
        },
        {
            "telecom": [
                {
                    "system": "other",
                    "value": "http://www.hl7.org/Special/committees/orders/index.cfm"
                }
            ]
        }
    ],
    "mapping": [
        {
            "identity": "rim",
            "name": "RIM",
            "uri": "http://hl7.org/v3"
        },
        {
            "identity": "w5",
            "name": "W5 Mapping",
            "uri": "http://hl7.org/fhir/w5"
        }
    ],
    "status": "draft",
    "base": "http://hl7.org/fhir/StructureDefinition/DomainResource",
    "name": "NutritionOrder",
    "id": "NutritionOrder",
    "meta": {
        "lastUpdated": "2015-10-24T07:41:03.495+11:00"
    },
    "fhirVersion": "1.0.2",
    "date": "2015-10-24T07:41:03+11:00"
}