{
    "snapshot": {
        "element": [
            {
                "path": "Patient",
                "max": "*",
                "definition": "Demographics and other administrative information about an individual or animal receiving care or other health-related services.",
                "min": 0,
                "type": [
                    {
                        "code": "DomainResource"
                    }
                ],
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "ClinicalDocument.recordTarget.patientRole"
                    },
                    {
                        "identity": "rim",
                        "map": "Patient[classCode=PAT]"
                    },
                    {
                        "identity": "w5",
                        "map": "administrative.individual"
                    }
                ],
                "short": "Information about an individual or animal receiving health care services",
                "alias": [
                    "SubjectOfCare Client Resident"
                ]
            },
            {
                "path": "Patient.id",
                "max": "1",
                "definition": "The logical id of the resource, as used in the URL for the resource. Once assigned, this value never changes.",
                "min": 0,
                "comments": "The only time that a resource does not have an id is when it is being submitted to the server using a create operation. Bundles always have an id, though it is usually a generated UUID.",
                "short": "Logical id of this artifact",
                "type": [
                    {
                        "code": "id"
                    }
                ],
                "isSummary": true
            },
            {
                "path": "Patient.meta",
                "max": "1",
                "definition": "The metadata about the resource. This is content that is maintained by the infrastructure. Changes to the content may not always be associated with version changes to the resource.",
                "min": 0,
                "type": [
                    {
                        "code": "Meta"
                    }
                ],
                "short": "Metadata about the resource",
                "isSummary": true
            },
            {
                "path": "Patient.implicitRules",
                "max": "1",
                "definition": "A reference to a set of rules that were followed when the resource was constructed, and which must be understood when processing the content.",
                "min": 0,
                "comments": "Asserting this rule set restricts the content to be only understood by a limited set of trading partners. This inherently limits the usefulness of the data in the long term. However, the existing health eco-system is highly fractured, and not yet ready to define, collect, and exchange data in a generally computable sense. Wherever possible, implementers and/or specification writers should avoid using this element as much as possible.",
                "short": "A set of rules under which this content was created",
                "type": [
                    {
                        "code": "uri"
                    }
                ],
                "isSummary": true,
                "isModifier": true
            },
            {
                "path": "Patient.language",
                "max": "1",
                "definition": "The base language in which the resource is written.",
                "min": 0,
                "comments": "Language is provided to support indexing and accessibility (typically, services such as text to speech use the language tag). The html language tag in the narrative applies  to the narrative. The language tag on the resource may be used to specify the language of other presentations generated from the data in the resource  Not all the content has to be in the base language. The Resource.language should not be assumed to apply to the narrative automatically. If a language is specified, it should it also be specified on the div element in the html (see rules in HTML5 for information about the relationship between xml:lang and the html lang attribute).",
                "short": "Language of the resource content",
                "type": [
                    {
                        "code": "code"
                    }
                ],
                "binding": {
                    "strength": "required",
                    "valueSetUri": "http://tools.ietf.org/html/bcp47",
                    "description": "A human language."
                }
            },
            {
                "path": "Patient.text",
                "max": "1",
                "definition": "A human-readable narrative that contains a summary of the resource, and may be used to represent the content of the resource to a human. The narrative need not encode all the structured data, but is required to contain sufficient detail to make it \"clinically safe\" for a human to just read the narrative. Resource definitions may define what content should be represented in the narrative to ensure clinical safety.",
                "min": 0,
                "condition": [
                    "dom-1"
                ],
                "comments": "Contained resources do not have narrative. Resources that are not contained SHOULD have a narrative.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "Act.text?"
                    }
                ],
                "short": "Text summary of the resource, for human interpretation",
                "type": [
                    {
                        "code": "Narrative"
                    }
                ],
                "alias": [
                    "narrative",
                    "html",
                    "xhtml",
                    "display"
                ]
            },
            {
                "path": "Patient.contained",
                "max": "*",
                "definition": "These resources do not have an independent existence apart from the resource that contains them - they cannot be identified independently, and nor can they have their own independent transaction scope.",
                "min": 0,
                "comments": "This should never be done when the content can be identified properly, as once identification is lost, it is extremely difficult (and context dependent) to restore it again.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "N/A"
                    }
                ],
                "short": "Contained, inline Resources",
                "type": [
                    {
                        "code": "Resource"
                    }
                ],
                "alias": [
                    "inline resources",
                    "anonymous resources",
                    "contained resources"
                ]
            },
            {
                "path": "Patient.extension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the resource. In order to make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.",
                "min": 0,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "N/A"
                    }
                ],
                "short": "Additional Content defined by implementations",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content"
                ]
            },
            {
                "path": "Patient.modifierExtension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the resource, and that modifies the understanding of the element that contains it. Usually modifier elements provide negation or qualification. In order to make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.",
                "min": 0,
                "isModifier": true,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "N/A"
                    }
                ],
                "short": "Extensions that cannot be ignored",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content"
                ]
            },
            {
                "path": "Patient.identifier",
                "max": "*",
                "definition": "An identifier for this patient.",
                "min": 0,
                "requirements": "Patients are almost always assigned specific numerical identifiers.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": ".id"
                    },
                    {
                        "identity": "v2",
                        "map": "PID-3"
                    },
                    {
                        "identity": "rim",
                        "map": "id"
                    },
                    {
                        "identity": "w5",
                        "map": "id"
                    }
                ],
                "short": "An identifier for this patient",
                "type": [
                    {
                        "code": "Identifier"
                    }
                ],
                "isSummary": true
            },
            {
                "path": "Patient.active",
                "min": 0,
                "comments": "Default is true. If a record is inactive, and linked to an active record, then future patient/record updates should occur on the other patient.",
                "defaultValueBoolean": true,
                "short": "Whether this patient's record is in active use",
                "type": [
                    {
                        "code": "boolean"
                    }
                ],
                "isSummary": true,
                "max": "1",
                "definition": "Whether this patient record is in active use.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "rim",
                        "map": "statusCode"
                    },
                    {
                        "identity": "w5",
                        "map": "status"
                    }
                ],
                "requirements": "Need to be able to mark a patient record as not to be used because it was created in error.",
                "isModifier": true
            },
            {
                "path": "Patient.name",
                "max": "*",
                "definition": "A name associated with the individual.",
                "min": 0,
                "requirements": "Need to be able to track the patient by multiple names. Examples are your official name and a partner name.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": ".patient.name"
                    },
                    {
                        "identity": "v2",
                        "map": "PID-5, PID-9"
                    },
                    {
                        "identity": "rim",
                        "map": "name"
                    }
                ],
                "short": "A name associated with the patient",
                "comments": "A patient may have multiple names with different uses or applicable periods. For animals, the name is a \"HumanName\" in the sense that is assigned and used by humans and has the same patterns.",
                "isSummary": true,
                "type": [
                    {
                        "code": "HumanName"
                    }
                ]
            },
            {
                "path": "Patient.telecom",
                "max": "*",
                "definition": "A contact detail (e.g. a telephone number or an email address) by which the individual may be contacted.",
                "min": 0,
                "requirements": "People have (primary) ways to contact them in some way such as phone, email.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": ".telecom"
                    },
                    {
                        "identity": "v2",
                        "map": "PID-13, PID-14, PID-40"
                    },
                    {
                        "identity": "rim",
                        "map": "telecom"
                    }
                ],
                "short": "A contact detail for the individual",
                "comments": "A Patient may have multiple ways to be contacted with different uses or applicable periods.  May need to have options for contacting the person urgently and also to help with identification. The address may not go directly to the individual, but may reach another party that is able to proxy for the patient (i.e. home phone, or pet owner's phone).",
                "isSummary": true,
                "type": [
                    {
                        "code": "ContactPoint"
                    }
                ]
            },
            {
                "path": "Patient.gender",
                "max": "1",
                "definition": "Administrative Gender - the gender that the patient is considered to have for administration and record keeping purposes.",
                "min": 0,
                "requirements": "Needed for identification of the individual, in combination with (at least) name and birth date. Gender of individual drives many clinical processes.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": ".patient.administrativeGenderCode"
                    },
                    {
                        "identity": "v2",
                        "map": "PID-8"
                    },
                    {
                        "identity": "rim",
                        "map": "player[classCode=PSN|ANM and determinerCode=INSTANCE]/administrativeGender"
                    }
                ],
                "short": "male | female | other | unknown",
                "comments": "The gender may not match the biological sex as determined by genetics, or the individual's preferred identification. Note that for both humans and particularly animals, there are other legitimate possibilities than M and F, though the vast majority of systems and contexts only support M and F.  Systems providing decision support or enforcing business rules should ideally do this on the basis of Observations dealing with the specific gender aspect of interest (anatomical, chromosonal, social, etc.)  However, because these observations are infrequently recorded, defaulting to the administrative gender is common practice.  Where such defaulting occurs, rule enforcement should allow for the variation between administrative and biological, chromosonal and other gender aspects.  For example, an alert about a hysterectomy on a male should be handled as a warning or overrideable error, not a \"hard\" error.",
                "isSummary": true,
                "binding": {
                    "strength": "required",
                    "description": "The gender of a person used for administrative purposes.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/administrative-gender"
                    }
                },
                "type": [
                    {
                        "code": "code"
                    }
                ]
            },
            {
                "path": "Patient.birthDate",
                "max": "1",
                "definition": "The date of birth for the individual.",
                "min": 0,
                "requirements": "Age of the individual drives many clinical processes.",
                "mapping": [
                    {
                        "identity": "loinc",
                        "map": "21112-8"
                    },
                    {
                        "identity": "cda",
                        "map": ".patient.birthTime"
                    },
                    {
                        "identity": "v2",
                        "map": "PID-7"
                    },
                    {
                        "identity": "rim",
                        "map": "player[classCode=PSN|ANM and determinerCode=INSTANCE]/birthTime"
                    }
                ],
                "short": "The date of birth for the individual",
                "comments": "At least an estimated year should be provided as a guess if the real DOB is unknown  There is a standard extension \"patient-birthTime\" available that should be used where Time is required (such as in maternaty/infant care systems).",
                "isSummary": true,
                "type": [
                    {
                        "code": "date"
                    }
                ]
            },
            {
                "path": "Patient.deceased[x]",
                "max": "1",
                "definition": "Indicates if the individual is deceased or not.",
                "min": 0,
                "isModifier": true,
                "requirements": "The fact that a patient is deceased influences the clinical process. Also, in human communication and relation management it is necessary to know whether the person is alive.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "v2",
                        "map": "PID-30  (bool) and PID-29 (datetime)"
                    },
                    {
                        "identity": "rim",
                        "map": "player[classCode=PSN|ANM and determinerCode=INSTANCE]/deceasedInd, player[classCode=PSN|ANM and determinerCode=INSTANCE]/deceasedTime"
                    }
                ],
                "short": "Indicates if the individual is deceased or not",
                "comments": "If there's no value in the instance it means there is no statement on whether or not the individual is deceased. Most systems will interpret the absence of a value as a sign of the person being alive.",
                "isSummary": true,
                "type": [
                    {
                        "code": "boolean"
                    },
                    {
                        "code": "dateTime"
                    }
                ]
            },
            {
                "path": "Patient.address",
                "max": "*",
                "definition": "Addresses for the individual.",
                "min": 0,
                "requirements": "May need to keep track of patient addresses for contacting, billing or reporting requirements and also to help with identification.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": ".addr"
                    },
                    {
                        "identity": "v2",
                        "map": "PID-11"
                    },
                    {
                        "identity": "rim",
                        "map": "addr"
                    }
                ],
                "short": "Addresses for the individual",
                "comments": "Patient may have multiple addresses with different uses or applicable periods.",
                "isSummary": true,
                "type": [
                    {
                        "code": "Address"
                    }
                ]
            },
            {
                "path": "Patient.maritalStatus",
                "max": "1",
                "definition": "This field contains a patient's most recent marital (civil) status.",
                "min": 0,
                "requirements": "Most, if not all systems capture it.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": ".patient.maritalStatusCode"
                    },
                    {
                        "identity": "v2",
                        "map": "PID-16"
                    },
                    {
                        "identity": "rim",
                        "map": "player[classCode=PSN]/maritalStatusCode"
                    }
                ],
                "short": "Marital (civil) status of a patient",
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "binding": {
                    "strength": "required",
                    "description": "The domestic partnership status of a person.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/marital-status"
                    }
                }
            },
            {
                "path": "Patient.multipleBirth[x]",
                "max": "1",
                "definition": "Indicates whether the patient is part of a multiple or indicates the actual birth order.",
                "min": 0,
                "requirements": "For disambiguation of multiple-birth children, especially relevant where the care provider doesn't meet the patient, such as labs.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "v2",
                        "map": "PID-24 (bool), PID-25 (integer)"
                    },
                    {
                        "identity": "rim",
                        "map": "player[classCode=PSN|ANM and determinerCode=INSTANCE]/multipleBirthInd,  player[classCode=PSN|ANM and determinerCode=INSTANCE]/multipleBirthOrderNumber"
                    }
                ],
                "short": "Whether patient is part of a multiple birth",
                "type": [
                    {
                        "code": "boolean"
                    },
                    {
                        "code": "integer"
                    }
                ]
            },
            {
                "path": "Patient.photo",
                "max": "*",
                "definition": "Image of the patient.",
                "min": 0,
                "requirements": "Many EHR systems have the capability to capture an image of the patient. Fits with newer social media usage too.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "v2",
                        "map": "OBX-5 - needs a profile"
                    },
                    {
                        "identity": "rim",
                        "map": "player[classCode=PSN|ANM and determinerCode=INSTANCE]/desc"
                    }
                ],
                "short": "Image of the patient",
                "type": [
                    {
                        "code": "Attachment"
                    }
                ]
            },
            {
                "path": "Patient.contact",
                "max": "*",
                "definition": "A contact party (e.g. guardian, partner, friend) for the patient.",
                "extension": [
                    {
                        "valueString": "Contact",
                        "url": "http://hl7.org/fhir/StructureDefinition/structuredefinition-explicit-type-name"
                    }
                ],
                "comments": "Contact covers all kinds of contact parties: family members, business contacts, guardians, caregivers. Not applicable to register pedigree and family ties beyond use of having contact.",
                "constraint": [
                    {
                        "key": "pat-1",
                        "severity": "error",
                        "xpath": "f:name or f:telecom or f:address or f:organization",
                        "human": "SHALL at least contain a contact's details or a reference to an organization"
                    }
                ],
                "min": 0,
                "short": "A contact party (e.g. guardian, partner, friend) for the patient",
                "requirements": "Need to track people you can contact about the patient.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "rim",
                        "map": "player[classCode=PSN|ANM and determinerCode=INSTANCE]/scopedRole[classCode=CON]"
                    }
                ],
                "type": [
                    {
                        "code": "BackboneElement"
                    }
                ]
            },
            {
                "path": "Patient.contact.id",
                "max": "1",
                "representation": [
                    "xmlAttr"
                ],
                "definition": "unique id for the element within a resource (for internal references).",
                "min": 0,
                "type": [
                    {
                        "code": "id"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "n/a"
                    }
                ],
                "short": "xml:id (or equivalent in JSON)"
            },
            {
                "path": "Patient.contact.extension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the element. In order to make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.",
                "min": 0,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "n/a"
                    }
                ],
                "short": "Additional Content defined by implementations",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content"
                ]
            },
            {
                "path": "Patient.contact.modifierExtension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the element, and that modifies the understanding of the element that contains it. Usually modifier elements provide negation or qualification. In order to make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.",
                "min": 0,
                "isModifier": true,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "N/A"
                    }
                ],
                "short": "Extensions that cannot be ignored",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content",
                    "modifiers"
                ]
            },
            {
                "path": "Patient.contact.relationship",
                "max": "*",
                "definition": "The nature of the relationship between the patient and the contact person.",
                "min": 0,
                "requirements": "Used to determine which contact person is the most relevant to approach, depending on circumstances.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "v2",
                        "map": "NK1-7, NK1-3"
                    },
                    {
                        "identity": "rim",
                        "map": "code"
                    }
                ],
                "short": "The kind of relationship",
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "binding": {
                    "strength": "extensible",
                    "description": "The nature of the relationship between a patient and a contact person for that patient.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/patient-contact-relationship"
                    }
                }
            },
            {
                "path": "Patient.contact.name",
                "max": "1",
                "definition": "A name associated with the contact person.",
                "min": 0,
                "requirements": "Contact persons need to be identified by name, but it is uncommon to need details about multiple other names for that contact person.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "v2",
                        "map": "NK1-2"
                    },
                    {
                        "identity": "rim",
                        "map": "name"
                    }
                ],
                "short": "A name associated with the contact person",
                "type": [
                    {
                        "code": "HumanName"
                    }
                ]
            },
            {
                "path": "Patient.contact.telecom",
                "max": "*",
                "definition": "A contact detail for the person, e.g. a telephone number or an email address.",
                "min": 0,
                "requirements": "People have (primary) ways to contact them in some way such as phone, email.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "v2",
                        "map": "NK1-5, NK1-6, NK1-40"
                    },
                    {
                        "identity": "rim",
                        "map": "telecom"
                    }
                ],
                "short": "A contact detail for the person",
                "comments": "Contact may have multiple ways to be contacted with different uses or applicable periods.  May need to have options for contacting the person urgently, and also to help with identification.",
                "type": [
                    {
                        "code": "ContactPoint"
                    }
                ]
            },
            {
                "path": "Patient.contact.address",
                "max": "1",
                "definition": "Address for the contact person.",
                "min": 0,
                "requirements": "Need to keep track where the contact person can be contacted per postal mail or visited.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "v2",
                        "map": "NK1-4"
                    },
                    {
                        "identity": "rim",
                        "map": "addr"
                    }
                ],
                "short": "Address for the contact person",
                "type": [
                    {
                        "code": "Address"
                    }
                ]
            },
            {
                "path": "Patient.contact.gender",
                "max": "1",
                "definition": "Administrative Gender - the gender that the contact person is considered to have for administration and record keeping purposes.",
                "min": 0,
                "requirements": "Needed to address the person correctly.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "v2",
                        "map": "NK1-15"
                    },
                    {
                        "identity": "rim",
                        "map": "player[classCode=PSN|ANM and determinerCode=INSTANCE]/administrativeGender"
                    }
                ],
                "short": "male | female | other | unknown",
                "type": [
                    {
                        "code": "code"
                    }
                ],
                "binding": {
                    "strength": "required",
                    "description": "The gender of a person used for administrative purposes.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/administrative-gender"
                    }
                }
            },
            {
                "path": "Patient.contact.organization",
                "max": "1",
                "definition": "Organization on behalf of which the contact is acting or for which the contact is working.",
                "min": 0,
                "condition": [
                    "pat-1"
                ],
                "requirements": "For guardians or business related contacts, the organization is relevant.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "v2",
                        "map": "NK1-13, NK1-30, NK1-31, NK1-32, NK1-41"
                    },
                    {
                        "identity": "rim",
                        "map": "scoper"
                    }
                ],
                "short": "Organization that is associated with the contact",
                "type": [
                    {
                        "code": "Reference",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/Organization"
                        ]
                    }
                ]
            },
            {
                "path": "Patient.contact.period",
                "max": "1",
                "definition": "The period during which this contact person or organization is valid to be contacted relating to this patient.",
                "min": 0,
                "type": [
                    {
                        "code": "Period"
                    }
                ],
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "rim",
                        "map": "effectiveTime"
                    }
                ],
                "short": "The period during which this contact person or organization is valid to be contacted relating to this patient"
            },
            {
                "path": "Patient.animal",
                "extension": [
                    {
                        "valueString": "Animal",
                        "url": "http://hl7.org/fhir/StructureDefinition/structuredefinition-explicit-type-name"
                    }
                ],
                "comments": "The animal element is labeled \"Is Modifier\" since patients may be non-human. Systems SHALL either handle patient details appropriately (e.g. inform users patient is not human) or reject declared animal records.   The absense of the animal element does not imply that the patient is a human. If a system requires such a positive assertion that the patient is human, an extension will be required.  (Do not use a species of homo-sapiens in animal species, as this would incorrectly infer that the patient is an animal).",
                "short": "This patient is known to be an animal (non-human)",
                "type": [
                    {
                        "code": "BackboneElement"
                    }
                ],
                "isSummary": true,
                "max": "1",
                "definition": "This patient is known to be an animal.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "rim",
                        "map": "player[classCode=ANM]"
                    }
                ],
                "requirements": "Many clinical systems are extended to care for animal patients as well as human.",
                "min": 0,
                "isModifier": true
            },
            {
                "path": "Patient.animal.id",
                "max": "1",
                "representation": [
                    "xmlAttr"
                ],
                "definition": "unique id for the element within a resource (for internal references).",
                "min": 0,
                "type": [
                    {
                        "code": "id"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "n/a"
                    }
                ],
                "short": "xml:id (or equivalent in JSON)"
            },
            {
                "path": "Patient.animal.extension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the element. In order to make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.",
                "min": 0,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "n/a"
                    }
                ],
                "short": "Additional Content defined by implementations",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content"
                ]
            },
            {
                "path": "Patient.animal.modifierExtension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the element, and that modifies the understanding of the element that contains it. Usually modifier elements provide negation or qualification. In order to make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.",
                "min": 0,
                "isModifier": true,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "N/A"
                    }
                ],
                "short": "Extensions that cannot be ignored",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content",
                    "modifiers"
                ]
            },
            {
                "path": "Patient.animal.species",
                "max": "1",
                "definition": "Identifies the high level taxonomic categorization of the kind of animal.",
                "min": 1,
                "requirements": "Need to know what kind of animal.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "v2",
                        "map": "PID-35"
                    },
                    {
                        "identity": "rim",
                        "map": "code"
                    }
                ],
                "short": "E.g. Dog, Cow",
                "comments": "If the patient is non-human, at least a species SHALL be specified. Species SHALL be a widely recognised taxonomic classification.  It may or may not be Linnaean taxonomy and may or may not be at the level of species. If the level is finer than species--such as a breed code--the code system used SHALL allow inference of the species.  (The common example is that the word \"Hereford\" does not allow inference of the species Bos taurus, because there is a Hereford pig breed, but the SNOMED CT code for \"Hereford Cattle Breed\" does.).",
                "isSummary": true,
                "binding": {
                    "strength": "example",
                    "description": "The species of an animal.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/animal-species"
                    }
                },
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ]
            },
            {
                "path": "Patient.animal.breed",
                "max": "1",
                "definition": "Identifies the detailed categorization of the kind of animal.",
                "min": 0,
                "requirements": "May need to know the specific kind within the species.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "v2",
                        "map": "PID-37"
                    },
                    {
                        "identity": "rim",
                        "map": "playedRole[classCode=GEN]/scoper[classCode=ANM, determinerCode=KIND]/code"
                    }
                ],
                "short": "E.g. Poodle, Angus",
                "comments": "Breed MAY be used to provide further taxonomic or non-taxonomic classification.  It may involve local or proprietary designation--such as commercial strain--and/or additional information such as production type.",
                "isSummary": true,
                "binding": {
                    "strength": "example",
                    "description": "The breed of an animal.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/animal-breeds"
                    }
                },
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ]
            },
            {
                "path": "Patient.animal.genderStatus",
                "max": "1",
                "definition": "Indicates the current state of the animal's reproductive organs.",
                "min": 0,
                "requirements": "Gender status can affect housing and animal behavior.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "v2",
                        "map": "N/A"
                    },
                    {
                        "identity": "rim",
                        "map": "genderStatusCode"
                    }
                ],
                "short": "E.g. Neutered, Intact",
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "isSummary": true,
                "binding": {
                    "strength": "example",
                    "description": "The state of the animal's reproductive organs.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/animal-genderstatus"
                    }
                }
            },
            {
                "path": "Patient.communication",
                "max": "*",
                "definition": "Languages which may be used to communicate with the patient about his or her health.",
                "min": 0,
                "requirements": "If a patient does not speak the local language, interpreters may be required, so languages spoken and proficiency is an important things to keep track of both for patient and other persons of interest.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "patient.languageCommunication"
                    },
                    {
                        "identity": "rim",
                        "map": "LanguageCommunication"
                    }
                ],
                "short": "A list of Languages which may be used to communicate with the patient about his or her health",
                "comments": "If no language is specified, this *implies* that the default local language is spoken.  If you need to convey proficiency for multiple modes then you need multiple Patient.Communication associations.   For animals, language is not a relevant field, and should be absent from the instance. If the Patient does not speak the default local language, then the Interpreter Required Standard can be used to explicitly declare that an interpreter is required.",
                "type": [
                    {
                        "code": "BackboneElement"
                    }
                ]
            },
            {
                "path": "Patient.communication.id",
                "max": "1",
                "representation": [
                    "xmlAttr"
                ],
                "definition": "unique id for the element within a resource (for internal references).",
                "min": 0,
                "type": [
                    {
                        "code": "id"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "n/a"
                    }
                ],
                "short": "xml:id (or equivalent in JSON)"
            },
            {
                "path": "Patient.communication.extension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the element. In order to make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.",
                "min": 0,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "n/a"
                    }
                ],
                "short": "Additional Content defined by implementations",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content"
                ]
            },
            {
                "path": "Patient.communication.modifierExtension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the element, and that modifies the understanding of the element that contains it. Usually modifier elements provide negation or qualification. In order to make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.",
                "min": 0,
                "isModifier": true,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "N/A"
                    }
                ],
                "short": "Extensions that cannot be ignored",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content",
                    "modifiers"
                ]
            },
            {
                "path": "Patient.communication.language",
                "max": "1",
                "definition": "The ISO-639-1 alpha 2 code in lower case for the language, optionally followed by a hyphen and the ISO-3166-1 alpha 2 code for the region in upper case; e.g. \"en\" for English, or \"en-US\" for American English versus \"en-EN\" for England English.",
                "min": 1,
                "requirements": "Most systems in multilingual countries will want to convey language. Not all systems actually need the regional dialect.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": ".languageCode"
                    },
                    {
                        "identity": "v2",
                        "map": "PID-15, LAN-2"
                    },
                    {
                        "identity": "rim",
                        "map": "player[classCode=PSN|ANM and determinerCode=INSTANCE]/languageCommunication/code"
                    }
                ],
                "short": "The language which can be used to communicate with the patient about his or her health",
                "comments": "The structure aa-BB with this exact casing is one the most widely used notations for locale. However not all systems actually code this but instead have it as free text. Hence CodeableConcept instead of code as the data type.",
                "binding": {
                    "strength": "required",
                    "valueSetUri": "http://tools.ietf.org/html/bcp47",
                    "description": "A human language."
                },
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ]
            },
            {
                "path": "Patient.communication.preferred",
                "max": "1",
                "definition": "Indicates whether or not the patient prefers this language (over other languages he masters up a certain level).",
                "min": 0,
                "requirements": "People that master multiple languages up to certain level may prefer one or more, i.e. feel more confident in communicating in a particular language making other languages sort of a fall back method.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": ".preferenceInd"
                    },
                    {
                        "identity": "v2",
                        "map": "PID-15"
                    },
                    {
                        "identity": "rim",
                        "map": "preferenceInd"
                    }
                ],
                "short": "Language preference indicator",
                "comments": "This language is specifically identified for communicating healthcare information.",
                "type": [
                    {
                        "code": "boolean"
                    }
                ]
            },
            {
                "path": "Patient.careProvider",
                "max": "*",
                "definition": "Patient's nominated care provider.",
                "min": 0,
                "comments": "This may be the primary care provider (in a GP context), or it may be a patient nominated care manager in a community/disablity setting, or even organization that will provide people to perform the care provider roles.\n\nThis is not to be used to record Care Teams, these should be recorded on either the CarePlan or EpisodeOfCare resources.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "v2",
                        "map": "PD1-4"
                    },
                    {
                        "identity": "rim",
                        "map": "subjectOf.CareEvent.performer.AssignedEntity"
                    }
                ],
                "short": "Patient's nominated primary care provider",
                "type": [
                    {
                        "code": "Reference",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/Organization"
                        ]
                    },
                    {
                        "code": "Reference",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/Practitioner"
                        ]
                    }
                ]
            },
            {
                "path": "Patient.managingOrganization",
                "max": "1",
                "definition": "Organization that is the custodian of the patient record.",
                "min": 0,
                "requirements": "Need to know who recognizes this patient record, manages and updates it.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": ".providerOrganization"
                    },
                    {
                        "identity": "rim",
                        "map": "scoper"
                    }
                ],
                "short": "Organization that is the custodian of the patient record",
                "comments": "There is only one managing organization for a specific patient record. Other organizations will have their own Patient record, and may use the Link property to join the records together (or a Person resource which can include confidence ratings for the association).",
                "isSummary": true,
                "type": [
                    {
                        "code": "Reference",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/Organization"
                        ]
                    }
                ]
            },
            {
                "path": "Patient.link",
                "max": "*",
                "definition": "Link to another patient resource that concerns the same actual patient.",
                "min": 0,
                "isModifier": true,
                "requirements": "There are multiple usecases: \n\n* Duplicate patient records due to the clerical errors associated with the difficulties of identifying humans consistently, and * Distribution of patient information across multiple servers.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "rim",
                        "map": "outboundLink"
                    }
                ],
                "short": "Link to another patient resource that concerns the same actual person",
                "comments": "There is no assumption that linked patient records have mutual links.",
                "type": [
                    {
                        "code": "BackboneElement"
                    }
                ]
            },
            {
                "path": "Patient.link.id",
                "max": "1",
                "representation": [
                    "xmlAttr"
                ],
                "definition": "unique id for the element within a resource (for internal references).",
                "min": 0,
                "type": [
                    {
                        "code": "id"
                    }
                ],
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "n/a"
                    }
                ],
                "short": "xml:id (or equivalent in JSON)"
            },
            {
                "path": "Patient.link.extension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the element. In order to make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.",
                "min": 0,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "n/a"
                    }
                ],
                "short": "Additional Content defined by implementations",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content"
                ]
            },
            {
                "path": "Patient.link.modifierExtension",
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the element, and that modifies the understanding of the element that contains it. Usually modifier elements provide negation or qualification. In order to make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.",
                "min": 0,
                "isModifier": true,
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "N/A"
                    }
                ],
                "short": "Extensions that cannot be ignored",
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "alias": [
                    "extensions",
                    "user content",
                    "modifiers"
                ]
            },
            {
                "path": "Patient.link.other",
                "max": "1",
                "definition": "The other patient resource that the link refers to.",
                "min": 1,
                "type": [
                    {
                        "code": "Reference",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/Patient"
                        ]
                    }
                ],
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "v2",
                        "map": "PID-3, MRG-1"
                    },
                    {
                        "identity": "rim",
                        "map": "id"
                    }
                ],
                "short": "The other patient resource that the link refers to",
                "isModifier": true
            },
            {
                "path": "Patient.link.type",
                "max": "1",
                "definition": "The type of link between this patient resource and another patient resource.",
                "min": 1,
                "type": [
                    {
                        "code": "code"
                    }
                ],
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "rim",
                        "map": "typeCode"
                    }
                ],
                "short": "replace | refer | seealso - type of link",
                "binding": {
                    "strength": "required",
                    "description": "The type of link between this patient resource and another patient resource.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/link-type"
                    }
                },
                "isModifier": true
            }
        ]
    },
    "publisher": "Health Level Seven International (Patient Administration)",
    "abstract": false,
    "extension": [
        {
            "valueInteger": 3,
            "url": "http://hl7.org/fhir/StructureDefinition/structuredefinition-fmm"
        }
    ],
    "differential": {
        "element": [
            {
                "path": "Patient",
                "max": "*",
                "definition": "Demographics and other administrative information about an individual or animal receiving care or other health-related services.",
                "min": 0,
                "type": [
                    {
                        "code": "DomainResource"
                    }
                ],
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "ClinicalDocument.recordTarget.patientRole"
                    },
                    {
                        "identity": "rim",
                        "map": "Patient[classCode=PAT]"
                    },
                    {
                        "identity": "w5",
                        "map": "administrative.individual"
                    }
                ],
                "short": "Information about an individual or animal receiving health care services",
                "alias": [
                    "SubjectOfCare Client Resident"
                ]
            },
            {
                "path": "Patient.identifier",
                "max": "*",
                "definition": "An identifier for this patient.",
                "min": 0,
                "requirements": "Patients are almost always assigned specific numerical identifiers.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": ".id"
                    },
                    {
                        "identity": "v2",
                        "map": "PID-3"
                    },
                    {
                        "identity": "rim",
                        "map": "id"
                    },
                    {
                        "identity": "w5",
                        "map": "id"
                    }
                ],
                "short": "An identifier for this patient",
                "type": [
                    {
                        "code": "Identifier"
                    }
                ],
                "isSummary": true
            },
            {
                "path": "Patient.active",
                "min": 0,
                "comments": "Default is true. If a record is inactive, and linked to an active record, then future patient/record updates should occur on the other patient.",
                "defaultValueBoolean": true,
                "short": "Whether this patient's record is in active use",
                "type": [
                    {
                        "code": "boolean"
                    }
                ],
                "isSummary": true,
                "max": "1",
                "definition": "Whether this patient record is in active use.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "rim",
                        "map": "statusCode"
                    },
                    {
                        "identity": "w5",
                        "map": "status"
                    }
                ],
                "requirements": "Need to be able to mark a patient record as not to be used because it was created in error.",
                "isModifier": true
            },
            {
                "path": "Patient.name",
                "max": "*",
                "definition": "A name associated with the individual.",
                "min": 0,
                "requirements": "Need to be able to track the patient by multiple names. Examples are your official name and a partner name.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": ".patient.name"
                    },
                    {
                        "identity": "v2",
                        "map": "PID-5, PID-9"
                    },
                    {
                        "identity": "rim",
                        "map": "name"
                    }
                ],
                "short": "A name associated with the patient",
                "comments": "A patient may have multiple names with different uses or applicable periods. For animals, the name is a \"HumanName\" in the sense that is assigned and used by humans and has the same patterns.",
                "isSummary": true,
                "type": [
                    {
                        "code": "HumanName"
                    }
                ]
            },
            {
                "path": "Patient.telecom",
                "max": "*",
                "definition": "A contact detail (e.g. a telephone number or an email address) by which the individual may be contacted.",
                "min": 0,
                "requirements": "People have (primary) ways to contact them in some way such as phone, email.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": ".telecom"
                    },
                    {
                        "identity": "v2",
                        "map": "PID-13, PID-14, PID-40"
                    },
                    {
                        "identity": "rim",
                        "map": "telecom"
                    }
                ],
                "short": "A contact detail for the individual",
                "comments": "A Patient may have multiple ways to be contacted with different uses or applicable periods.  May need to have options for contacting the person urgently and also to help with identification. The address may not go directly to the individual, but may reach another party that is able to proxy for the patient (i.e. home phone, or pet owner's phone).",
                "isSummary": true,
                "type": [
                    {
                        "code": "ContactPoint"
                    }
                ]
            },
            {
                "path": "Patient.gender",
                "max": "1",
                "definition": "Administrative Gender - the gender that the patient is considered to have for administration and record keeping purposes.",
                "min": 0,
                "requirements": "Needed for identification of the individual, in combination with (at least) name and birth date. Gender of individual drives many clinical processes.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": ".patient.administrativeGenderCode"
                    },
                    {
                        "identity": "v2",
                        "map": "PID-8"
                    },
                    {
                        "identity": "rim",
                        "map": "player[classCode=PSN|ANM and determinerCode=INSTANCE]/administrativeGender"
                    }
                ],
                "short": "male | female | other | unknown",
                "comments": "The gender may not match the biological sex as determined by genetics, or the individual's preferred identification. Note that for both humans and particularly animals, there are other legitimate possibilities than M and F, though the vast majority of systems and contexts only support M and F.  Systems providing decision support or enforcing business rules should ideally do this on the basis of Observations dealing with the specific gender aspect of interest (anatomical, chromosonal, social, etc.)  However, because these observations are infrequently recorded, defaulting to the administrative gender is common practice.  Where such defaulting occurs, rule enforcement should allow for the variation between administrative and biological, chromosonal and other gender aspects.  For example, an alert about a hysterectomy on a male should be handled as a warning or overrideable error, not a \"hard\" error.",
                "isSummary": true,
                "binding": {
                    "strength": "required",
                    "description": "The gender of a person used for administrative purposes.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/administrative-gender"
                    }
                },
                "type": [
                    {
                        "code": "code"
                    }
                ]
            },
            {
                "path": "Patient.birthDate",
                "max": "1",
                "definition": "The date of birth for the individual.",
                "min": 0,
                "requirements": "Age of the individual drives many clinical processes.",
                "mapping": [
                    {
                        "identity": "loinc",
                        "map": "21112-8"
                    },
                    {
                        "identity": "cda",
                        "map": ".patient.birthTime"
                    },
                    {
                        "identity": "v2",
                        "map": "PID-7"
                    },
                    {
                        "identity": "rim",
                        "map": "player[classCode=PSN|ANM and determinerCode=INSTANCE]/birthTime"
                    }
                ],
                "short": "The date of birth for the individual",
                "comments": "At least an estimated year should be provided as a guess if the real DOB is unknown  There is a standard extension \"patient-birthTime\" available that should be used where Time is required (such as in maternaty/infant care systems).",
                "isSummary": true,
                "type": [
                    {
                        "code": "date"
                    }
                ]
            },
            {
                "path": "Patient.deceased[x]",
                "max": "1",
                "definition": "Indicates if the individual is deceased or not.",
                "min": 0,
                "isModifier": true,
                "requirements": "The fact that a patient is deceased influences the clinical process. Also, in human communication and relation management it is necessary to know whether the person is alive.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "v2",
                        "map": "PID-30  (bool) and PID-29 (datetime)"
                    },
                    {
                        "identity": "rim",
                        "map": "player[classCode=PSN|ANM and determinerCode=INSTANCE]/deceasedInd, player[classCode=PSN|ANM and determinerCode=INSTANCE]/deceasedTime"
                    }
                ],
                "short": "Indicates if the individual is deceased or not",
                "comments": "If there's no value in the instance it means there is no statement on whether or not the individual is deceased. Most systems will interpret the absence of a value as a sign of the person being alive.",
                "isSummary": true,
                "type": [
                    {
                        "code": "boolean"
                    },
                    {
                        "code": "dateTime"
                    }
                ]
            },
            {
                "path": "Patient.address",
                "max": "*",
                "definition": "Addresses for the individual.",
                "min": 0,
                "requirements": "May need to keep track of patient addresses for contacting, billing or reporting requirements and also to help with identification.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": ".addr"
                    },
                    {
                        "identity": "v2",
                        "map": "PID-11"
                    },
                    {
                        "identity": "rim",
                        "map": "addr"
                    }
                ],
                "short": "Addresses for the individual",
                "comments": "Patient may have multiple addresses with different uses or applicable periods.",
                "isSummary": true,
                "type": [
                    {
                        "code": "Address"
                    }
                ]
            },
            {
                "path": "Patient.maritalStatus",
                "max": "1",
                "definition": "This field contains a patient's most recent marital (civil) status.",
                "min": 0,
                "requirements": "Most, if not all systems capture it.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": ".patient.maritalStatusCode"
                    },
                    {
                        "identity": "v2",
                        "map": "PID-16"
                    },
                    {
                        "identity": "rim",
                        "map": "player[classCode=PSN]/maritalStatusCode"
                    }
                ],
                "short": "Marital (civil) status of a patient",
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "binding": {
                    "strength": "required",
                    "description": "The domestic partnership status of a person.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/marital-status"
                    }
                }
            },
            {
                "path": "Patient.multipleBirth[x]",
                "max": "1",
                "definition": "Indicates whether the patient is part of a multiple or indicates the actual birth order.",
                "min": 0,
                "requirements": "For disambiguation of multiple-birth children, especially relevant where the care provider doesn't meet the patient, such as labs.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "v2",
                        "map": "PID-24 (bool), PID-25 (integer)"
                    },
                    {
                        "identity": "rim",
                        "map": "player[classCode=PSN|ANM and determinerCode=INSTANCE]/multipleBirthInd,  player[classCode=PSN|ANM and determinerCode=INSTANCE]/multipleBirthOrderNumber"
                    }
                ],
                "short": "Whether patient is part of a multiple birth",
                "type": [
                    {
                        "code": "boolean"
                    },
                    {
                        "code": "integer"
                    }
                ]
            },
            {
                "path": "Patient.photo",
                "max": "*",
                "definition": "Image of the patient.",
                "min": 0,
                "requirements": "Many EHR systems have the capability to capture an image of the patient. Fits with newer social media usage too.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "v2",
                        "map": "OBX-5 - needs a profile"
                    },
                    {
                        "identity": "rim",
                        "map": "player[classCode=PSN|ANM and determinerCode=INSTANCE]/desc"
                    }
                ],
                "short": "Image of the patient",
                "type": [
                    {
                        "code": "Attachment"
                    }
                ]
            },
            {
                "path": "Patient.contact",
                "max": "*",
                "definition": "A contact party (e.g. guardian, partner, friend) for the patient.",
                "extension": [
                    {
                        "valueString": "Contact",
                        "url": "http://hl7.org/fhir/StructureDefinition/structuredefinition-explicit-type-name"
                    }
                ],
                "comments": "Contact covers all kinds of contact parties: family members, business contacts, guardians, caregivers. Not applicable to register pedigree and family ties beyond use of having contact.",
                "constraint": [
                    {
                        "key": "pat-1",
                        "severity": "error",
                        "xpath": "f:name or f:telecom or f:address or f:organization",
                        "human": "SHALL at least contain a contact's details or a reference to an organization"
                    }
                ],
                "min": 0,
                "short": "A contact party (e.g. guardian, partner, friend) for the patient",
                "requirements": "Need to track people you can contact about the patient.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "rim",
                        "map": "player[classCode=PSN|ANM and determinerCode=INSTANCE]/scopedRole[classCode=CON]"
                    }
                ],
                "type": [
                    {
                        "code": "BackboneElement"
                    }
                ]
            },
            {
                "path": "Patient.contact.relationship",
                "max": "*",
                "definition": "The nature of the relationship between the patient and the contact person.",
                "min": 0,
                "requirements": "Used to determine which contact person is the most relevant to approach, depending on circumstances.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "v2",
                        "map": "NK1-7, NK1-3"
                    },
                    {
                        "identity": "rim",
                        "map": "code"
                    }
                ],
                "short": "The kind of relationship",
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "binding": {
                    "strength": "extensible",
                    "description": "The nature of the relationship between a patient and a contact person for that patient.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/patient-contact-relationship"
                    }
                }
            },
            {
                "path": "Patient.contact.name",
                "max": "1",
                "definition": "A name associated with the contact person.",
                "min": 0,
                "requirements": "Contact persons need to be identified by name, but it is uncommon to need details about multiple other names for that contact person.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "v2",
                        "map": "NK1-2"
                    },
                    {
                        "identity": "rim",
                        "map": "name"
                    }
                ],
                "short": "A name associated with the contact person",
                "type": [
                    {
                        "code": "HumanName"
                    }
                ]
            },
            {
                "path": "Patient.contact.telecom",
                "max": "*",
                "definition": "A contact detail for the person, e.g. a telephone number or an email address.",
                "min": 0,
                "requirements": "People have (primary) ways to contact them in some way such as phone, email.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "v2",
                        "map": "NK1-5, NK1-6, NK1-40"
                    },
                    {
                        "identity": "rim",
                        "map": "telecom"
                    }
                ],
                "short": "A contact detail for the person",
                "comments": "Contact may have multiple ways to be contacted with different uses or applicable periods.  May need to have options for contacting the person urgently, and also to help with identification.",
                "type": [
                    {
                        "code": "ContactPoint"
                    }
                ]
            },
            {
                "path": "Patient.contact.address",
                "max": "1",
                "definition": "Address for the contact person.",
                "min": 0,
                "requirements": "Need to keep track where the contact person can be contacted per postal mail or visited.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "v2",
                        "map": "NK1-4"
                    },
                    {
                        "identity": "rim",
                        "map": "addr"
                    }
                ],
                "short": "Address for the contact person",
                "type": [
                    {
                        "code": "Address"
                    }
                ]
            },
            {
                "path": "Patient.contact.gender",
                "max": "1",
                "definition": "Administrative Gender - the gender that the contact person is considered to have for administration and record keeping purposes.",
                "min": 0,
                "requirements": "Needed to address the person correctly.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "v2",
                        "map": "NK1-15"
                    },
                    {
                        "identity": "rim",
                        "map": "player[classCode=PSN|ANM and determinerCode=INSTANCE]/administrativeGender"
                    }
                ],
                "short": "male | female | other | unknown",
                "type": [
                    {
                        "code": "code"
                    }
                ],
                "binding": {
                    "strength": "required",
                    "description": "The gender of a person used for administrative purposes.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/administrative-gender"
                    }
                }
            },
            {
                "path": "Patient.contact.organization",
                "max": "1",
                "definition": "Organization on behalf of which the contact is acting or for which the contact is working.",
                "min": 0,
                "condition": [
                    "pat-1"
                ],
                "requirements": "For guardians or business related contacts, the organization is relevant.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "v2",
                        "map": "NK1-13, NK1-30, NK1-31, NK1-32, NK1-41"
                    },
                    {
                        "identity": "rim",
                        "map": "scoper"
                    }
                ],
                "short": "Organization that is associated with the contact",
                "type": [
                    {
                        "code": "Reference",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/Organization"
                        ]
                    }
                ]
            },
            {
                "path": "Patient.contact.period",
                "max": "1",
                "definition": "The period during which this contact person or organization is valid to be contacted relating to this patient.",
                "min": 0,
                "type": [
                    {
                        "code": "Period"
                    }
                ],
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "rim",
                        "map": "effectiveTime"
                    }
                ],
                "short": "The period during which this contact person or organization is valid to be contacted relating to this patient"
            },
            {
                "path": "Patient.animal",
                "extension": [
                    {
                        "valueString": "Animal",
                        "url": "http://hl7.org/fhir/StructureDefinition/structuredefinition-explicit-type-name"
                    }
                ],
                "comments": "The animal element is labeled \"Is Modifier\" since patients may be non-human. Systems SHALL either handle patient details appropriately (e.g. inform users patient is not human) or reject declared animal records.   The absense of the animal element does not imply that the patient is a human. If a system requires such a positive assertion that the patient is human, an extension will be required.  (Do not use a species of homo-sapiens in animal species, as this would incorrectly infer that the patient is an animal).",
                "short": "This patient is known to be an animal (non-human)",
                "type": [
                    {
                        "code": "BackboneElement"
                    }
                ],
                "isSummary": true,
                "max": "1",
                "definition": "This patient is known to be an animal.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "rim",
                        "map": "player[classCode=ANM]"
                    }
                ],
                "requirements": "Many clinical systems are extended to care for animal patients as well as human.",
                "min": 0,
                "isModifier": true
            },
            {
                "path": "Patient.animal.species",
                "max": "1",
                "definition": "Identifies the high level taxonomic categorization of the kind of animal.",
                "min": 1,
                "requirements": "Need to know what kind of animal.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "v2",
                        "map": "PID-35"
                    },
                    {
                        "identity": "rim",
                        "map": "code"
                    }
                ],
                "short": "E.g. Dog, Cow",
                "comments": "If the patient is non-human, at least a species SHALL be specified. Species SHALL be a widely recognised taxonomic classification.  It may or may not be Linnaean taxonomy and may or may not be at the level of species. If the level is finer than species--such as a breed code--the code system used SHALL allow inference of the species.  (The common example is that the word \"Hereford\" does not allow inference of the species Bos taurus, because there is a Hereford pig breed, but the SNOMED CT code for \"Hereford Cattle Breed\" does.).",
                "isSummary": true,
                "binding": {
                    "strength": "example",
                    "description": "The species of an animal.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/animal-species"
                    }
                },
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ]
            },
            {
                "path": "Patient.animal.breed",
                "max": "1",
                "definition": "Identifies the detailed categorization of the kind of animal.",
                "min": 0,
                "requirements": "May need to know the specific kind within the species.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "v2",
                        "map": "PID-37"
                    },
                    {
                        "identity": "rim",
                        "map": "playedRole[classCode=GEN]/scoper[classCode=ANM, determinerCode=KIND]/code"
                    }
                ],
                "short": "E.g. Poodle, Angus",
                "comments": "Breed MAY be used to provide further taxonomic or non-taxonomic classification.  It may involve local or proprietary designation--such as commercial strain--and/or additional information such as production type.",
                "isSummary": true,
                "binding": {
                    "strength": "example",
                    "description": "The breed of an animal.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/animal-breeds"
                    }
                },
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ]
            },
            {
                "path": "Patient.animal.genderStatus",
                "max": "1",
                "definition": "Indicates the current state of the animal's reproductive organs.",
                "min": 0,
                "requirements": "Gender status can affect housing and animal behavior.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "v2",
                        "map": "N/A"
                    },
                    {
                        "identity": "rim",
                        "map": "genderStatusCode"
                    }
                ],
                "short": "E.g. Neutered, Intact",
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "isSummary": true,
                "binding": {
                    "strength": "example",
                    "description": "The state of the animal's reproductive organs.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/animal-genderstatus"
                    }
                }
            },
            {
                "path": "Patient.communication",
                "max": "*",
                "definition": "Languages which may be used to communicate with the patient about his or her health.",
                "min": 0,
                "requirements": "If a patient does not speak the local language, interpreters may be required, so languages spoken and proficiency is an important things to keep track of both for patient and other persons of interest.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "patient.languageCommunication"
                    },
                    {
                        "identity": "rim",
                        "map": "LanguageCommunication"
                    }
                ],
                "short": "A list of Languages which may be used to communicate with the patient about his or her health",
                "comments": "If no language is specified, this *implies* that the default local language is spoken.  If you need to convey proficiency for multiple modes then you need multiple Patient.Communication associations.   For animals, language is not a relevant field, and should be absent from the instance. If the Patient does not speak the default local language, then the Interpreter Required Standard can be used to explicitly declare that an interpreter is required.",
                "type": [
                    {
                        "code": "BackboneElement"
                    }
                ]
            },
            {
                "path": "Patient.communication.language",
                "max": "1",
                "definition": "The ISO-639-1 alpha 2 code in lower case for the language, optionally followed by a hyphen and the ISO-3166-1 alpha 2 code for the region in upper case; e.g. \"en\" for English, or \"en-US\" for American English versus \"en-EN\" for England English.",
                "min": 1,
                "requirements": "Most systems in multilingual countries will want to convey language. Not all systems actually need the regional dialect.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": ".languageCode"
                    },
                    {
                        "identity": "v2",
                        "map": "PID-15, LAN-2"
                    },
                    {
                        "identity": "rim",
                        "map": "player[classCode=PSN|ANM and determinerCode=INSTANCE]/languageCommunication/code"
                    }
                ],
                "short": "The language which can be used to communicate with the patient about his or her health",
                "comments": "The structure aa-BB with this exact casing is one the most widely used notations for locale. However not all systems actually code this but instead have it as free text. Hence CodeableConcept instead of code as the data type.",
                "binding": {
                    "strength": "required",
                    "valueSetUri": "http://tools.ietf.org/html/bcp47",
                    "description": "A human language."
                },
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ]
            },
            {
                "path": "Patient.communication.preferred",
                "max": "1",
                "definition": "Indicates whether or not the patient prefers this language (over other languages he masters up a certain level).",
                "min": 0,
                "requirements": "People that master multiple languages up to certain level may prefer one or more, i.e. feel more confident in communicating in a particular language making other languages sort of a fall back method.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": ".preferenceInd"
                    },
                    {
                        "identity": "v2",
                        "map": "PID-15"
                    },
                    {
                        "identity": "rim",
                        "map": "preferenceInd"
                    }
                ],
                "short": "Language preference indicator",
                "comments": "This language is specifically identified for communicating healthcare information.",
                "type": [
                    {
                        "code": "boolean"
                    }
                ]
            },
            {
                "path": "Patient.careProvider",
                "max": "*",
                "definition": "Patient's nominated care provider.",
                "min": 0,
                "comments": "This may be the primary care provider (in a GP context), or it may be a patient nominated care manager in a community/disablity setting, or even organization that will provide people to perform the care provider roles.\n\nThis is not to be used to record Care Teams, these should be recorded on either the CarePlan or EpisodeOfCare resources.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "v2",
                        "map": "PD1-4"
                    },
                    {
                        "identity": "rim",
                        "map": "subjectOf.CareEvent.performer.AssignedEntity"
                    }
                ],
                "short": "Patient's nominated primary care provider",
                "type": [
                    {
                        "code": "Reference",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/Organization"
                        ]
                    },
                    {
                        "code": "Reference",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/Practitioner"
                        ]
                    }
                ]
            },
            {
                "path": "Patient.managingOrganization",
                "max": "1",
                "definition": "Organization that is the custodian of the patient record.",
                "min": 0,
                "requirements": "Need to know who recognizes this patient record, manages and updates it.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": ".providerOrganization"
                    },
                    {
                        "identity": "rim",
                        "map": "scoper"
                    }
                ],
                "short": "Organization that is the custodian of the patient record",
                "comments": "There is only one managing organization for a specific patient record. Other organizations will have their own Patient record, and may use the Link property to join the records together (or a Person resource which can include confidence ratings for the association).",
                "isSummary": true,
                "type": [
                    {
                        "code": "Reference",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/Organization"
                        ]
                    }
                ]
            },
            {
                "path": "Patient.link",
                "max": "*",
                "definition": "Link to another patient resource that concerns the same actual patient.",
                "min": 0,
                "isModifier": true,
                "requirements": "There are multiple usecases: \n\n* Duplicate patient records due to the clerical errors associated with the difficulties of identifying humans consistently, and * Distribution of patient information across multiple servers.",
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "rim",
                        "map": "outboundLink"
                    }
                ],
                "short": "Link to another patient resource that concerns the same actual person",
                "comments": "There is no assumption that linked patient records have mutual links.",
                "type": [
                    {
                        "code": "BackboneElement"
                    }
                ]
            },
            {
                "path": "Patient.link.other",
                "max": "1",
                "definition": "The other patient resource that the link refers to.",
                "min": 1,
                "type": [
                    {
                        "code": "Reference",
                        "profile": [
                            "http://hl7.org/fhir/StructureDefinition/Patient"
                        ]
                    }
                ],
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "v2",
                        "map": "PID-3, MRG-1"
                    },
                    {
                        "identity": "rim",
                        "map": "id"
                    }
                ],
                "short": "The other patient resource that the link refers to",
                "isModifier": true
            },
            {
                "path": "Patient.link.type",
                "max": "1",
                "definition": "The type of link between this patient resource and another patient resource.",
                "min": 1,
                "type": [
                    {
                        "code": "code"
                    }
                ],
                "mapping": [
                    {
                        "identity": "cda",
                        "map": "n/a"
                    },
                    {
                        "identity": "rim",
                        "map": "typeCode"
                    }
                ],
                "short": "replace | refer | seealso - type of link",
                "binding": {
                    "strength": "required",
                    "description": "The type of link between this patient resource and another patient resource.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/link-type"
                    }
                },
                "isModifier": true
            }
        ]
    },
    "resourceType": "StructureDefinition",
    "description": "Base StructureDefinition for Patient Resource",
    "url": "http://hl7.org/fhir/StructureDefinition/Patient",
    "kind": "resource",
    "contact": [
        {
            "telecom": [
                {
                    "system": "other",
                    "value": "http://hl7.org/fhir"
                }
            ]
        },
        {
            "telecom": [
                {
                    "system": "other",
                    "value": "http://www.hl7.org/Special/committees/pafm/index.cfm"
                }
            ]
        }
    ],
    "mapping": [
        {
            "identity": "cda",
            "name": "CDA (R2)",
            "uri": "http://hl7.org/v3/cda"
        },
        {
            "identity": "rim",
            "name": "RIM",
            "uri": "http://hl7.org/v3"
        },
        {
            "identity": "w5",
            "name": "W5 Mapping",
            "uri": "http://hl7.org/fhir/w5"
        },
        {
            "identity": "v2",
            "name": "HL7 v2",
            "uri": "http://hl7.org/v2"
        },
        {
            "identity": "loinc",
            "name": "LOINC",
            "uri": "http://loinc.org"
        }
    ],
    "status": "draft",
    "requirements": "Tracking patient is the center of the healthcare process.",
    "base": "http://hl7.org/fhir/StructureDefinition/DomainResource",
    "name": "Patient",
    "id": "Patient",
    "meta": {
        "lastUpdated": "2015-10-24T07:41:03.495+11:00"
    },
    "fhirVersion": "1.0.2",
    "date": "2015-10-24T07:41:03+11:00"
}