{
    "id": "Subscription",
    "date": "2015-10-24T07:41:03+11:00",
    "differential": {
        "element": [
            {
                "type": [
                    {
                        "code": "DomainResource"
                    }
                ],
                "max": "*",
                "definition": "The subscription resource is used to define a push based subscription from a server to another system. Once a subscription is registered with the server, the server checks every resource that is created or updated, and if the resource matches the given criteria, it sends a message on the defined \"channel\" so that another system is able to take an appropriate action.",
                "short": "A server push subscription criteria",
                "min": 0,
                "alias": [
                    "WebHook",
                    "Hook",
                    "Routing Rule"
                ],
                "isSummary": true,
                "path": "Subscription",
                "mapping": [
                    {
                        "map": "N/A",
                        "identity": "rim"
                    },
                    {
                        "map": "infrastructure.exchange",
                        "identity": "w5"
                    }
                ]
            },
            {
                "type": [
                    {
                        "code": "string"
                    }
                ],
                "max": "1",
                "definition": "The rules that the server should use to determine when to generate notifications for this subscription.",
                "short": "Rule for server push criteria",
                "min": 1,
                "comments": "The rules are a search criteria (without the [base] part). Like Bundle.entry.request.url, it has no leading \"/\".",
                "path": "Subscription.criteria",
                "isSummary": true
            },
            {
                "type": [
                    {
                        "code": "ContactPoint"
                    }
                ],
                "max": "*",
                "definition": "Contact details for a human to contact about the subscription. The primary use of this for system administrator troubleshooting.",
                "short": "Contact details for source (e.g. troubleshooting)",
                "min": 0,
                "isSummary": true,
                "path": "Subscription.contact",
                "mapping": [
                    {
                        "map": "who.focus",
                        "identity": "w5"
                    }
                ]
            },
            {
                "type": [
                    {
                        "code": "string"
                    }
                ],
                "max": "1",
                "definition": "A description of why this subscription is defined.",
                "short": "Description of why this subscription was created",
                "min": 1,
                "isSummary": true,
                "path": "Subscription.reason",
                "mapping": [
                    {
                        "map": "why",
                        "identity": "w5"
                    }
                ]
            },
            {
                "type": [
                    {
                        "code": "code"
                    }
                ],
                "max": "1",
                "definition": "The status of the subscription, which marks the server state for managing the subscription.",
                "isModifier": true,
                "mapping": [
                    {
                        "map": "status",
                        "identity": "w5"
                    }
                ],
                "short": "requested | active | error | off",
                "min": 1,
                "binding": {
                    "description": "The status of a subscription.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/subscription-status"
                    },
                    "strength": "required"
                },
                "comments": "A client can only submit subscription resources in the requested or off state. Only the server can  move a subscription from requested to active, and then to error. Either the server or the client can turn a subscription off.",
                "path": "Subscription.status",
                "isSummary": true
            },
            {
                "type": [
                    {
                        "code": "string"
                    }
                ],
                "max": "1",
                "definition": "A record of the last error that occurred when the server processed a notification.",
                "short": "Latest error note",
                "min": 0,
                "isSummary": true,
                "path": "Subscription.error"
            },
            {
                "type": [
                    {
                        "code": "BackboneElement"
                    }
                ],
                "max": "1",
                "definition": "Details where to send notifications when resources are received that meet the criteria.",
                "short": "The channel on which to report matches to the criteria",
                "min": 1,
                "isSummary": true,
                "path": "Subscription.channel"
            },
            {
                "type": [
                    {
                        "code": "code"
                    }
                ],
                "max": "1",
                "definition": "The type of channel to send notifications on.",
                "short": "rest-hook | websocket | email | sms | message",
                "min": 1,
                "binding": {
                    "description": "The type of method used to execute a subscription.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/subscription-channel-type"
                    },
                    "strength": "required"
                },
                "isSummary": true,
                "path": "Subscription.channel.type"
            },
            {
                "type": [
                    {
                        "code": "uri"
                    }
                ],
                "max": "1",
                "definition": "The uri that describes the actual end-point to send messages to.",
                "short": "Where the channel points to",
                "min": 0,
                "comments": "For rest-hook, and websocket, the end-point must be an http: or https: URL; for email, a mailto: url, for sms, a tel: url, and for message the endpoint can be in any form of url the server understands (usually, http: or mllp:). The URI is allowed to be relative; in which case, it is relative to the server end-point (since their may be more than one, clients should avoid using relative URIs).",
                "path": "Subscription.channel.endpoint",
                "isSummary": true
            },
            {
                "type": [
                    {
                        "code": "string"
                    }
                ],
                "max": "1",
                "definition": "The mime type to send the payload in - either application/xml+fhir, or application/json+fhir. If the mime type is blank, then there is no payload in the notification, just a notification.",
                "short": "Mimetype to send, or blank for no payload",
                "min": 1,
                "comments": "Sending the payload has obvious security consequences. The server is responsible for ensuring that the content is appropriately secured.",
                "path": "Subscription.channel.payload",
                "isSummary": true
            },
            {
                "type": [
                    {
                        "code": "string"
                    }
                ],
                "max": "1",
                "definition": "Additional headers / information to send as part of the notification.",
                "short": "Usage depends on the channel type",
                "min": 0,
                "comments": "Exactly what these mean depend on the channel type. The can convey additional information to the recipient and/or meet security requirements.",
                "path": "Subscription.channel.header",
                "isSummary": true
            },
            {
                "type": [
                    {
                        "code": "instant"
                    }
                ],
                "max": "1",
                "definition": "The time for the server to turn the subscription off.",
                "mapping": [
                    {
                        "map": "when.done",
                        "identity": "w5"
                    }
                ],
                "short": "When to automatically delete the subscription",
                "min": 0,
                "comments": "The server is permitted to deviate from this time, but should observe it.",
                "path": "Subscription.end",
                "isSummary": true
            },
            {
                "type": [
                    {
                        "code": "Coding"
                    }
                ],
                "max": "*",
                "definition": "A tag to add to any resource that matches the criteria, after the subscription is processed.",
                "short": "A tag to add to matching resources",
                "min": 0,
                "binding": {
                    "description": "Tags to put on a resource after subscriptions have been sent.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/subscription-tag"
                    },
                    "strength": "example"
                },
                "comments": "So that other systems can tell which resources have been the subject of a notification.",
                "path": "Subscription.tag",
                "isSummary": true
            }
        ]
    },
    "name": "Subscription",
    "abstract": false,
    "status": "draft",
    "kind": "resource",
    "extension": [
        {
            "url": "http://hl7.org/fhir/StructureDefinition/structuredefinition-fmm",
            "valueInteger": 1
        }
    ],
    "snapshot": {
        "element": [
            {
                "type": [
                    {
                        "code": "DomainResource"
                    }
                ],
                "max": "*",
                "definition": "The subscription resource is used to define a push based subscription from a server to another system. Once a subscription is registered with the server, the server checks every resource that is created or updated, and if the resource matches the given criteria, it sends a message on the defined \"channel\" so that another system is able to take an appropriate action.",
                "short": "A server push subscription criteria",
                "min": 0,
                "alias": [
                    "WebHook",
                    "Hook",
                    "Routing Rule"
                ],
                "isSummary": true,
                "path": "Subscription",
                "mapping": [
                    {
                        "map": "N/A",
                        "identity": "rim"
                    },
                    {
                        "map": "infrastructure.exchange",
                        "identity": "w5"
                    }
                ]
            },
            {
                "type": [
                    {
                        "code": "id"
                    }
                ],
                "max": "1",
                "definition": "The logical id of the resource, as used in the URL for the resource. Once assigned, this value never changes.",
                "short": "Logical id of this artifact",
                "min": 0,
                "comments": "The only time that a resource does not have an id is when it is being submitted to the server using a create operation. Bundles always have an id, though it is usually a generated UUID.",
                "path": "Subscription.id",
                "isSummary": true
            },
            {
                "type": [
                    {
                        "code": "Meta"
                    }
                ],
                "max": "1",
                "definition": "The metadata about the resource. This is content that is maintained by the infrastructure. Changes to the content may not always be associated with version changes to the resource.",
                "short": "Metadata about the resource",
                "min": 0,
                "isSummary": true,
                "path": "Subscription.meta"
            },
            {
                "type": [
                    {
                        "code": "uri"
                    }
                ],
                "max": "1",
                "definition": "A reference to a set of rules that were followed when the resource was constructed, and which must be understood when processing the content.",
                "isModifier": true,
                "short": "A set of rules under which this content was created",
                "min": 0,
                "comments": "Asserting this rule set restricts the content to be only understood by a limited set of trading partners. This inherently limits the usefulness of the data in the long term. However, the existing health eco-system is highly fractured, and not yet ready to define, collect, and exchange data in a generally computable sense. Wherever possible, implementers and/or specification writers should avoid using this element as much as possible.",
                "path": "Subscription.implicitRules",
                "isSummary": true
            },
            {
                "type": [
                    {
                        "code": "code"
                    }
                ],
                "max": "1",
                "definition": "The base language in which the resource is written.",
                "short": "Language of the resource content",
                "min": 0,
                "binding": {
                    "description": "A human language.",
                    "strength": "required",
                    "valueSetUri": "http://tools.ietf.org/html/bcp47"
                },
                "comments": "Language is provided to support indexing and accessibility (typically, services such as text to speech use the language tag). The html language tag in the narrative applies  to the narrative. The language tag on the resource may be used to specify the language of other presentations generated from the data in the resource  Not all the content has to be in the base language. The Resource.language should not be assumed to apply to the narrative automatically. If a language is specified, it should it also be specified on the div element in the html (see rules in HTML5 for information about the relationship between xml:lang and the html lang attribute).",
                "path": "Subscription.language"
            },
            {
                "condition": [
                    "dom-1"
                ],
                "type": [
                    {
                        "code": "Narrative"
                    }
                ],
                "max": "1",
                "definition": "A human-readable narrative that contains a summary of the resource, and may be used to represent the content of the resource to a human. The narrative need not encode all the structured data, but is required to contain sufficient detail to make it \"clinically safe\" for a human to just read the narrative. Resource definitions may define what content should be represented in the narrative to ensure clinical safety.",
                "short": "Text summary of the resource, for human interpretation",
                "min": 0,
                "alias": [
                    "narrative",
                    "html",
                    "xhtml",
                    "display"
                ],
                "comments": "Contained resources do not have narrative. Resources that are not contained SHOULD have a narrative.",
                "path": "Subscription.text",
                "mapping": [
                    {
                        "map": "Act.text?",
                        "identity": "rim"
                    }
                ]
            },
            {
                "type": [
                    {
                        "code": "Resource"
                    }
                ],
                "max": "*",
                "definition": "These resources do not have an independent existence apart from the resource that contains them - they cannot be identified independently, and nor can they have their own independent transaction scope.",
                "short": "Contained, inline Resources",
                "min": 0,
                "alias": [
                    "inline resources",
                    "anonymous resources",
                    "contained resources"
                ],
                "comments": "This should never be done when the content can be identified properly, as once identification is lost, it is extremely difficult (and context dependent) to restore it again.",
                "path": "Subscription.contained",
                "mapping": [
                    {
                        "map": "N/A",
                        "identity": "rim"
                    }
                ]
            },
            {
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the resource. In order to make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.",
                "short": "Additional Content defined by implementations",
                "min": 0,
                "alias": [
                    "extensions",
                    "user content"
                ],
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "path": "Subscription.extension",
                "mapping": [
                    {
                        "map": "N/A",
                        "identity": "rim"
                    }
                ]
            },
            {
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the resource, and that modifies the understanding of the element that contains it. Usually modifier elements provide negation or qualification. In order to make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.",
                "isModifier": true,
                "short": "Extensions that cannot be ignored",
                "min": 0,
                "alias": [
                    "extensions",
                    "user content"
                ],
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "path": "Subscription.modifierExtension",
                "mapping": [
                    {
                        "map": "N/A",
                        "identity": "rim"
                    }
                ]
            },
            {
                "type": [
                    {
                        "code": "string"
                    }
                ],
                "max": "1",
                "definition": "The rules that the server should use to determine when to generate notifications for this subscription.",
                "short": "Rule for server push criteria",
                "min": 1,
                "comments": "The rules are a search criteria (without the [base] part). Like Bundle.entry.request.url, it has no leading \"/\".",
                "path": "Subscription.criteria",
                "isSummary": true
            },
            {
                "type": [
                    {
                        "code": "ContactPoint"
                    }
                ],
                "max": "*",
                "definition": "Contact details for a human to contact about the subscription. The primary use of this for system administrator troubleshooting.",
                "short": "Contact details for source (e.g. troubleshooting)",
                "min": 0,
                "isSummary": true,
                "path": "Subscription.contact",
                "mapping": [
                    {
                        "map": "who.focus",
                        "identity": "w5"
                    }
                ]
            },
            {
                "type": [
                    {
                        "code": "string"
                    }
                ],
                "max": "1",
                "definition": "A description of why this subscription is defined.",
                "short": "Description of why this subscription was created",
                "min": 1,
                "isSummary": true,
                "path": "Subscription.reason",
                "mapping": [
                    {
                        "map": "why",
                        "identity": "w5"
                    }
                ]
            },
            {
                "type": [
                    {
                        "code": "code"
                    }
                ],
                "max": "1",
                "definition": "The status of the subscription, which marks the server state for managing the subscription.",
                "isModifier": true,
                "mapping": [
                    {
                        "map": "status",
                        "identity": "w5"
                    }
                ],
                "short": "requested | active | error | off",
                "min": 1,
                "binding": {
                    "description": "The status of a subscription.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/subscription-status"
                    },
                    "strength": "required"
                },
                "comments": "A client can only submit subscription resources in the requested or off state. Only the server can  move a subscription from requested to active, and then to error. Either the server or the client can turn a subscription off.",
                "path": "Subscription.status",
                "isSummary": true
            },
            {
                "type": [
                    {
                        "code": "string"
                    }
                ],
                "max": "1",
                "definition": "A record of the last error that occurred when the server processed a notification.",
                "short": "Latest error note",
                "min": 0,
                "isSummary": true,
                "path": "Subscription.error"
            },
            {
                "type": [
                    {
                        "code": "BackboneElement"
                    }
                ],
                "max": "1",
                "definition": "Details where to send notifications when resources are received that meet the criteria.",
                "short": "The channel on which to report matches to the criteria",
                "min": 1,
                "isSummary": true,
                "path": "Subscription.channel"
            },
            {
                "type": [
                    {
                        "code": "id"
                    }
                ],
                "max": "1",
                "definition": "unique id for the element within a resource (for internal references).",
                "representation": [
                    "xmlAttr"
                ],
                "short": "xml:id (or equivalent in JSON)",
                "min": 0,
                "mapping": [
                    {
                        "map": "n/a",
                        "identity": "rim"
                    }
                ],
                "path": "Subscription.channel.id"
            },
            {
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the element. In order to make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.",
                "short": "Additional Content defined by implementations",
                "min": 0,
                "alias": [
                    "extensions",
                    "user content"
                ],
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "path": "Subscription.channel.extension",
                "mapping": [
                    {
                        "map": "n/a",
                        "identity": "rim"
                    }
                ]
            },
            {
                "type": [
                    {
                        "code": "Extension"
                    }
                ],
                "max": "*",
                "definition": "May be used to represent additional information that is not part of the basic definition of the element, and that modifies the understanding of the element that contains it. Usually modifier elements provide negation or qualification. In order to make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.",
                "isModifier": true,
                "short": "Extensions that cannot be ignored",
                "min": 0,
                "alias": [
                    "extensions",
                    "user content",
                    "modifiers"
                ],
                "comments": "There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone.",
                "path": "Subscription.channel.modifierExtension",
                "mapping": [
                    {
                        "map": "N/A",
                        "identity": "rim"
                    }
                ]
            },
            {
                "type": [
                    {
                        "code": "code"
                    }
                ],
                "max": "1",
                "definition": "The type of channel to send notifications on.",
                "short": "rest-hook | websocket | email | sms | message",
                "min": 1,
                "binding": {
                    "description": "The type of method used to execute a subscription.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/subscription-channel-type"
                    },
                    "strength": "required"
                },
                "isSummary": true,
                "path": "Subscription.channel.type"
            },
            {
                "type": [
                    {
                        "code": "uri"
                    }
                ],
                "max": "1",
                "definition": "The uri that describes the actual end-point to send messages to.",
                "short": "Where the channel points to",
                "min": 0,
                "comments": "For rest-hook, and websocket, the end-point must be an http: or https: URL; for email, a mailto: url, for sms, a tel: url, and for message the endpoint can be in any form of url the server understands (usually, http: or mllp:). The URI is allowed to be relative; in which case, it is relative to the server end-point (since their may be more than one, clients should avoid using relative URIs).",
                "path": "Subscription.channel.endpoint",
                "isSummary": true
            },
            {
                "type": [
                    {
                        "code": "string"
                    }
                ],
                "max": "1",
                "definition": "The mime type to send the payload in - either application/xml+fhir, or application/json+fhir. If the mime type is blank, then there is no payload in the notification, just a notification.",
                "short": "Mimetype to send, or blank for no payload",
                "min": 1,
                "comments": "Sending the payload has obvious security consequences. The server is responsible for ensuring that the content is appropriately secured.",
                "path": "Subscription.channel.payload",
                "isSummary": true
            },
            {
                "type": [
                    {
                        "code": "string"
                    }
                ],
                "max": "1",
                "definition": "Additional headers / information to send as part of the notification.",
                "short": "Usage depends on the channel type",
                "min": 0,
                "comments": "Exactly what these mean depend on the channel type. The can convey additional information to the recipient and/or meet security requirements.",
                "path": "Subscription.channel.header",
                "isSummary": true
            },
            {
                "type": [
                    {
                        "code": "instant"
                    }
                ],
                "max": "1",
                "definition": "The time for the server to turn the subscription off.",
                "mapping": [
                    {
                        "map": "when.done",
                        "identity": "w5"
                    }
                ],
                "short": "When to automatically delete the subscription",
                "min": 0,
                "comments": "The server is permitted to deviate from this time, but should observe it.",
                "path": "Subscription.end",
                "isSummary": true
            },
            {
                "type": [
                    {
                        "code": "Coding"
                    }
                ],
                "max": "*",
                "definition": "A tag to add to any resource that matches the criteria, after the subscription is processed.",
                "short": "A tag to add to matching resources",
                "min": 0,
                "binding": {
                    "description": "Tags to put on a resource after subscriptions have been sent.",
                    "valueSetReference": {
                        "reference": "http://hl7.org/fhir/ValueSet/subscription-tag"
                    },
                    "strength": "example"
                },
                "comments": "So that other systems can tell which resources have been the subject of a notification.",
                "path": "Subscription.tag",
                "isSummary": true
            }
        ]
    },
    "description": "Base StructureDefinition for Subscription Resource",
    "url": "http://hl7.org/fhir/StructureDefinition/Subscription",
    "fhirVersion": "1.0.2",
    "base": "http://hl7.org/fhir/StructureDefinition/DomainResource",
    "mapping": [
        {
            "uri": "http://hl7.org/v3",
            "identity": "rim",
            "name": "RIM"
        },
        {
            "uri": "http://hl7.org/fhir/w5",
            "identity": "w5",
            "name": "W5 Mapping"
        }
    ],
    "resourceType": "StructureDefinition",
    "meta": {
        "lastUpdated": "2015-10-24T07:41:03.495+11:00"
    },
    "contact": [
        {
            "telecom": [
                {
                    "value": "http://hl7.org/fhir",
                    "system": "other"
                }
            ]
        },
        {
            "telecom": [
                {
                    "value": "http://www.hl7.org/Special/committees/fiwg/index.cfm",
                    "system": "other"
                }
            ]
        }
    ],
    "publisher": "Health Level Seven International (FHIR Infrastructure)"
}