{
    "resourceType": "ValueSet",
    "publisher": "HL7 (FHIR Project)",
    "date": "2015-10-24T07:41:03+11:00",
    "contact": [
        {
            "telecom": [
                {
                    "system": "other",
                    "value": "http://hl7.org/fhir"
                },
                {
                    "system": "email",
                    "value": "fhir@lists.hl7.org"
                }
            ]
        }
    ],
    "description": "Code representing the role the Object played in the event.",
    "extension": [
        {
            "valueUri": "urn:oid:2.16.840.1.113883.4.642.2.267",
            "url": "http://hl7.org/fhir/StructureDefinition/valueset-oid"
        }
    ],
    "status": "draft",
    "name": "AuditEventObjectRole",
    "meta": {
        "profile": [
            "http://hl7.org/fhir/StructureDefinition/valueset-shareable-definition"
        ],
        "lastUpdated": "2015-10-24T07:41:03.495+11:00"
    },
    "experimental": false,
    "codeSystem": {
        "system": "http://hl7.org/fhir/object-role",
        "caseSensitive": true,
        "version": "1.0.2",
        "extension": [
            {
                "valueUri": "urn:oid:2.16.840.1.113883.4.642.1.267",
                "url": "http://hl7.org/fhir/StructureDefinition/valueset-oid"
            }
        ],
        "concept": [
            {
                "code": "1",
                "definition": "This object is the patient that is the subject of care related to this event.  It is identifiable by patient ID or equivalent.  The patient may be either human or animal.",
                "display": "Patient"
            },
            {
                "code": "2",
                "definition": "This is a location identified as related to the event.  This is usually the location where the event took place.  Note that for shipping, the usual events are arrival at a location or departure from a location.",
                "display": "Location"
            },
            {
                "code": "3",
                "definition": "This object is any kind of persistent document created as a result of the event.  This could be a paper report, film, electronic report, DICOM Study, etc.  Issues related to medical records life cycle management are conveyed elsewhere.",
                "display": "Report"
            },
            {
                "code": "4",
                "definition": "A logical object related to a health record event.  This is any healthcare  specific resource (object) not restricted to FHIR defined Resources.",
                "display": "Domain Resource"
            },
            {
                "code": "5",
                "definition": "This is any configurable file used to control creation of documents.  Examples include the objects maintained by the HL7 Master File transactions, Value Sets, etc.",
                "display": "Master file"
            },
            {
                "code": "6",
                "definition": "A human participant not otherwise identified by some other category.",
                "display": "User"
            },
            {
                "code": "7",
                "definition": "(deprecated)",
                "display": "List"
            },
            {
                "code": "8",
                "definition": "Typically a licensed person who is providing or performing care related to the event, generally a physician.   The key distinction between doctor and practitioner is with regards to their role, not the licensing.  The doctor is the human who actually performed the work.  The practitioner is the human or organization that is responsible for the work.",
                "display": "Doctor"
            },
            {
                "code": "9",
                "definition": "A person or system that is being notified as part of the event.  This is relevant in situations where automated systems provide notifications to other parties when an event took place.",
                "display": "Subscriber"
            },
            {
                "code": "10",
                "definition": "Insurance company, or any other organization who accepts responsibility for paying for the healthcare event.",
                "display": "Guarantor"
            },
            {
                "code": "11",
                "definition": "A person or active system object involved in the event with a security role.",
                "display": "Security User Entity"
            },
            {
                "code": "12",
                "definition": "A person or system object involved in the event with the authority to modify security roles of other objects.",
                "display": "Security User Group"
            },
            {
                "code": "13",
                "definition": "A passive object, such as a role table, that is relevant to the event.",
                "display": "Security Resource"
            },
            {
                "code": "14",
                "definition": "(deprecated)  Relevant to certain RBAC security methodologies.",
                "display": "Security Granularity Definition"
            },
            {
                "code": "15",
                "definition": "Any person or organization responsible for providing care.  This encompasses all forms of care, licensed or otherwise, and all sorts of teams and care groups. Note, the distinction between practitioners and the doctor that actually provided the care to the patient.",
                "display": "Practitioner"
            },
            {
                "code": "16",
                "definition": "The source or destination for data transfer, when it does not match some other role.",
                "display": "Data Destination"
            },
            {
                "code": "17",
                "definition": "A source or destination for data transfer that acts as an archive, database, or similar role.",
                "display": "Data Repository"
            },
            {
                "code": "18",
                "definition": "An object that holds schedule information.  This could be an appointment book, availability information, etc.",
                "display": "Schedule"
            },
            {
                "code": "19",
                "definition": "An organization or person that is the recipient of services.  This could be an organization that is buying services for a patient, or a person that is buying services for an animal.",
                "display": "Customer"
            },
            {
                "code": "20",
                "definition": "An order, task, work item, procedure step, or other description of work to be performed; e.g. a particular instance of an MPPS.",
                "display": "Job"
            },
            {
                "code": "21",
                "definition": "A list of jobs or a system that provides lists of jobs; e.g. an MWL SCP.",
                "display": "Job Stream"
            },
            {
                "code": "22",
                "definition": "(Deprecated)",
                "display": "Table"
            },
            {
                "code": "23",
                "definition": "An object that specifies or controls the routing or delivery of items.  For example, a distribution list is the routing criteria for mail.  The items delivered may be documents, jobs, or other objects.",
                "display": "Routing Criteria"
            },
            {
                "code": "24",
                "definition": "The contents of a query.  This is used to capture the contents of any kind of query.  For security surveillance purposes knowing the queries being made is very important.",
                "display": "Query"
            }
        ]
    },
    "id": "object-role",
    "version": "1.0.2",
    "url": "http://hl7.org/fhir/ValueSet/object-role"
}