{
    "resourceType": "ValueSet",
    "publisher": "FHIR Project team",
    "date": "2015-10-24T07:41:03+11:00",
    "contact": [
        {
            "telecom": [
                {
                    "system": "other",
                    "value": "http://hl7.org/fhir"
                }
            ]
        }
    ],
    "description": "Observation Category codes.",
    "extension": [
        {
            "valueUri": "urn:oid:2.16.840.1.113883.4.642.2.222",
            "url": "http://hl7.org/fhir/StructureDefinition/valueset-oid"
        }
    ],
    "status": "draft",
    "name": "Observation Category Codes",
    "meta": {
        "profile": [
            "http://hl7.org/fhir/StructureDefinition/valueset-shareable-definition"
        ],
        "lastUpdated": "2015-10-24T07:41:03.495+11:00"
    },
    "experimental": true,
    "codeSystem": {
        "system": "http://hl7.org/fhir/observation-category",
        "caseSensitive": true,
        "extension": [
            {
                "valueUri": "urn:oid:2.16.840.1.113883.4.642.1.222",
                "url": "http://hl7.org/fhir/StructureDefinition/valueset-oid"
            }
        ],
        "concept": [
            {
                "code": "social-history",
                "definition": "The Social History Observations define the patient's occupational, personal (e.g. lifestyle), social, and environmental history and health risk factors, as well as administrative data such as marital status, race, ethnicity and religious affiliation.",
                "display": "Social History"
            },
            {
                "code": "vital-signs",
                "definition": " Clinical observations measure the body's basic functions such as such as blood pressure, heart rate, respiratory rate, height, weight, body mass index, head circumference, pulse oximetry, temperature, and body surface area.",
                "display": "Vital Signs"
            },
            {
                "code": "imaging",
                "definition": "Observations generated by imaging. The scope includes observations, plain x-ray, ultrasound, CT, MRI, angiography, echocardiography, nuclear medicine.",
                "display": "Imaging"
            },
            {
                "code": "laboratory",
                "definition": "The results of observations generated by laboratories.  Laboratory results are typically generated by laboratories providing analytic services in areas such as chemistry, hematology, serology, histology, cytology, anatomic pathology, microbiology, and/or virology. These observations are based on analysis of specimens obtained from the patient and submitted to the laboratory.",
                "display": "Laboratory"
            },
            {
                "code": "procedure",
                "definition": "Observations generated by other procedures.  This category includes observations resulting from interventional and non-interventional procedures excluding lab and imaging (e.g. cardiology catheterization, endoscopy, electrodiagnostics, etc.).  Procedure results are typically generated by a clinician to provide more granular information about component observations made during a procedure, such as where a gastroenterologist reports the size of a polyp observed during a colonoscopy.",
                "display": "Procedure"
            },
            {
                "code": "survey",
                "definition": "Assessment tool/survey instrument observations (e.g. Apgar Scores, Montreal Cognitive Assessment (MoCA))",
                "display": "Survey"
            },
            {
                "code": "exam",
                "definition": "Observations generated by physical exam findings including direct observations made by a clinician and use of simple instruments and the result of simple maneuvers performed directly on the patient's body.",
                "display": "Exam"
            },
            {
                "code": "therapy",
                "definition": "Observations generated by non-interventional treatment protocols (e.g. occupational, physical, radiation, nutritional and medication therapy)",
                "display": "Therapy"
            }
        ]
    },
    "id": "observation-category",
    "version": "1.0.2",
    "url": "http://hl7.org/fhir/ValueSet/observation-category"
}